{
  "metadata": {
    "title": "Complete Biblical Genealogy Database",
    "version": "2.0 - Corrected and Complete",
    "source": "King James Version Bible",
    "coverage": "Genesis through Revelation - All Biblical Genealogies",
    "date_corrected": "2025",
    "entries_count": 415,
    "note": "Repaired from corrupted JSON, completed with all missing biblical genealogies, validated structure",
    "last_updated": "2025-11-06",
    "status": "Complete - includes all major biblical genealogies from Adam to Jesus and the apostles"
  },
  "sered": {
    "name": "Sered",
    "bio": "Son of Zebulun, founder of the Seredite clan.",
    "scripture": "Gen 46:14; Num 26:26",
    "descendants": []
  },
  "elon": {
    "name": "Elon (Zebulun's son)",
    "bio": "Son of Zebulun, founder of the Elonite clan. Distinct from Elon the judge who also came from Zebulun's tribe.",
    "scripture": "Gen 46:14; Num 26:26",
    "descendants": []
  },
  "jahleel": {
    "name": "Jahleel",
    "bio": "Son of Zebulun, founder of the Jahleelite clan.",
    "scripture": "Gen 46:14; Num 26:26",
    "descendants": []
  },
  "joseph": {
    "name": "Joseph",
    "bio": "Eleventh son of Jacob, firstborn of Rachel. His name means 'may he add.' Beloved by Jacob, given a richly ornamented robe. Dreamed his family would bow to him. Brothers sold him to Midianites for 20 shekels; he was taken to Egypt. Served Potiphar, falsely accused by his wife, imprisoned. Interpreted dreams for Pharaoh's cupbearer and baker, then Pharaoh himself. Made second in command of Egypt at 30. Stored grain during plenty, sold it during famine. Brothers came for food; he tested then revealed himself. Brought Jacob's family to Egypt (70 people). Jacob blessed Joseph's sons Ephraim and Manasseh, crossing his hands. Joseph made brothers swear to carry his bones to Canaan. Lived 110 years. His life pictures Christ—rejected by brothers, exalted, saves his people.",
    "scripture": "Gen 30:22-24; 33:2, 7; 35:24; 37:2-50:26; Ex 1:5-6, 8; 13:19; Num 1:10, 32; 13:11; 26:28, 37; 27:1; 32:33; 34:23; 36:1, 5, 12; Deut 27:12; 33:13-17; Josh 14:4; 16:1-4; 17:1-2, 14-17; 18:5, 11; 24:32; Judg 1:22-23, 35; 1 Chr 2:2; 5:1-2; 7:29; Ps 77:15; 78:67; 80:1; 81:5; 105:17; Ezek 37:16, 19; 47:13; 48:32; Amos 5:6, 15; 6:6; Obad 1:18; Zech 10:6; John 4:5; Acts 7:9-18; Heb 11:21-22; Rev 7:8",
    "descendants": [
      "manasseh_joseph",
      "ephraim"
    ]
  },
  "manasseh_joseph": {
    "name": "Manasseh (Joseph's son)",
    "bio": "Firstborn son of Joseph by Asenath (daughter of Egyptian priest). Born in Egypt, his name means 'causing to forget'—Joseph said 'God has made me forget all my trouble.' Though firstborn, Jacob crossed his hands and gave the greater blessing to Ephraim. His tribe split: half settled east of Jordan, half west. The eastern half was first taken into exile by Assyria. Gideon, Jephthah came from Manasseh. King Manasseh of Judah was not from this tribe but from Judah.",
    "scripture": "Gen 41:51; 46:20; 48:1-20; 50:23; Num 1:10, 34-35; 26:28-34; 27:1; 32:33, 39-42; 34:14, 23; 36:1, 12; Deut 3:13-15; 33:17; 34:2; Josh 13:29-31; 14:4; 16:4, 9; 17:1-18; 22:1-34; Judg 1:27; 6:15, 35; 7:23; 11:29; 12:4; 18:30; 1 Chr 5:18-26; 7:14-19; 9:3; 12:19-20, 31, 37; 27:20-21; 2 Chr 15:9; 30:1, 10-11, 18; 31:1; 34:6, 9; Ps 60:7; 80:2; 108:8; Isa 9:21; Ezek 48:4; Rev 7:6",
    "descendants": [
      "machir"
    ]
  },
  "machir": {
    "name": "Machir",
    "bio": "Son of Manasseh, founder of Machirite clan. His sons conquered Gilead and Bashan. Moses gave Gilead to Machir's descendants. They were known as fierce warriors. Machir's daughter married Hezron of Judah. During David's exile from Absalom, Machir's descendant provided supplies. The territory east of Jordan became known for Machir's clan.",
    "scripture": "Gen 50:23; Num 26:29; 27:1; 32:39-40; 36:1; Deut 3:15; Josh 13:31; 17:1-3; Judg 5:14; 1 Chr 2:21, 23; 7:14-17",
    "descendants": [
      "gilead"
    ]
  },
  "gilead": {
    "name": "Gilead (Machir's son)",
    "bio": "Son of Machir, gave his name to the region east of Jordan. Founder of the Gileadite clan. Father of six sons who became clan leaders. The balm of Gilead was famous. Jephthah and Elijah were called Gileadites. Jabesh-gilead remained loyal to Saul's house.",
    "scripture": "Num 26:29-30; 27:1; 36:1; Josh 17:1, 3; Judg 5:17; 10:3; 11:1-2; 1 Chr 2:21, 23; 5:14; 7:14, 17",
    "descendants": [
      "jeezer",
      "helek",
      "asriel",
      "shechem_gilead",
      "hepher",
      "shemida"
    ]
  },
  "jeezer": {
    "name": "Jeezer (Abiezer)",
    "bio": "Son of Gilead, founder of the Jeezerite clan. Gideon came from this clan.",
    "scripture": "Num 26:30; Josh 17:2; Judg 6:11, 24, 34; 8:2",
    "descendants": []
  },
  "helek": {
    "name": "Helek",
    "bio": "Son of Gilead, founder of the Helekite clan.",
    "scripture": "Num 26:30; Josh 17:2",
    "descendants": []
  },
  "asriel": {
    "name": "Asriel (Gilead's son)",
    "bio": "Son of Gilead, founder of the Asrielite clan.",
    "scripture": "Num 26:31; Josh 17:2; 1 Chr 7:14",
    "descendants": []
  },
  "shechem_gilead": {
    "name": "Shechem (Gilead's line)",
    "bio": "Son of Gilead, founder of the Shechemite clan. Distinct from the Canaanite city and the man who violated Dinah.",
    "scripture": "Num 26:31; Josh 17:2",
    "descendants": []
  },
  "hepher": {
    "name": "Hepher (Gilead's son)",
    "bio": "Son of Gilead, founder of the Hepherite clan. Father of Zelophehad who had only daughters—they successfully petitioned Moses for inheritance rights, establishing precedent for daughters to inherit.",
    "scripture": "Num 26:32-33; 27:1; Josh 17:2-3",
    "descendants": [
      "zelophehad"
    ]
  },
  "zelophehad": {
    "name": "Zelophehad",
    "bio": "Son of Hepher, from Manasseh's tribe. Died in the wilderness leaving no sons, only five daughters. His daughters (Mahlah, Noah, Hoglah, Milcah, Tirzah) boldly approached Moses asking for inheritance rights. Moses consulted God, who granted their request, establishing that daughters could inherit if there were no sons. They were required to marry within their tribe to keep land in Manasseh. Their courage changed inheritance law for Israel.",
    "scripture": "Num 26:33; 27:1-11; 36:1-12; Josh 17:3-6; 1 Chr 7:15",
    "descendants": [
      "mahlah",
      "noah_zelophehad",
      "hoglah",
      "milcah_zelophehad",
      "tirzah"
    ]
  },
  "mahlah": {
    "name": "Mahlah",
    "bio": "Eldest daughter of Zelophehad. One of five sisters who successfully petitioned for inheritance rights when their father died without sons. Married within Manasseh's tribe as required.",
    "scripture": "Num 26:33; 27:1; 36:11; Josh 17:3",
    "descendants": []
  },
  "noah_zelophehad": {
    "name": "Noah (Zelophehad's daughter)",
    "bio": "Daughter of Zelophehad, one of five sisters who received their father's inheritance. Distinct from Noah the ark builder.",
    "scripture": "Num 26:33; 27:1; 36:11; Josh 17:3",
    "descendants": []
  },
  "hoglah": {
    "name": "Hoglah",
    "bio": "Daughter of Zelophehad, one of the five sisters who changed inheritance law in Israel.",
    "scripture": "Num 26:33; 27:1; 36:11; Josh 17:3",
    "descendants": []
  },
  "milcah_zelophehad": {
    "name": "Milcah (Zelophehad's daughter)",
    "bio": "Daughter of Zelophehad, one of the five sisters. Distinct from other Milcahs in Scripture.",
    "scripture": "Num 26:33; 27:1; 36:11; Josh 17:3",
    "descendants": []
  },
  "tirzah": {
    "name": "Tirzah (Zelophehad's daughter)",
    "bio": "Youngest daughter of Zelophehad, one of the five sisters. A city in Canaan was later named Tirzah and became capital of northern Israel.",
    "scripture": "Num 26:33; 27:1; 36:11; Josh 17:3",
    "descendants": []
  },
  "shemida": {
    "name": "Shemida",
    "bio": "Son of Gilead, founder of the Shemidaite clan.",
    "scripture": "Num 26:32; Josh 17:2; 1 Chr 7:19",
    "descendants": []
  },
  "ephraim": {
    "name": "Ephraim",
    "bio": "Second son of Joseph by Asenath. Born in Egypt, his name means 'fruitful'—Joseph said 'God has made me fruitful in the land of my suffering.' Though younger, he received the greater blessing from Jacob, who crossed his hands deliberately despite Joseph's protest. His tribe became powerful, often representing the northern kingdom. Joshua was from Ephraim. The tabernacle was at Shiloh in Ephraim for over 300 years. After the split, Jeroboam made Shechem (Ephraim) his capital. 'Ephraim' often refers to the whole northern kingdom. Blessed to be fruitful but often proud and idolatrous.",
    "scripture": "Gen 41:52; 46:20; 48:1-20; 50:23; Num 1:10, 32-33; 26:28, 35-37; 34:24; Deut 33:17; 34:2; Josh 14:4; 16:5-10; 17:8-10, 14-18; Judg 1:29; 5:14; 7:24; 8:1-2; 12:1-6; 1 Sam 1:1; 1 Kgs 11:26; 1 Chr 7:20-29; 2 Chr 13:4, 19; 15:8-9; 17:2; 25:7, 10; 28:7, 12; 30:1, 10, 18; Ps 60:7; 78:9, 67; 80:2; 108:8; Isa 7:2-17; 9:9, 21; 11:13; 17:3; 28:1-3; Jer 7:15; 31:6, 9, 18, 20; Ezek 37:16, 19; 48:5; Hos 4:17; 5:3-14; 6:4, 10; 7:1, 8, 11; 8:9, 11; 9:3-16; 10:6, 11; 11:3, 8-9, 12; 12:1, 8, 14; 13:1, 12; 14:8; Obad 1:19; Zech 9:10, 13; 10:7",
    "descendants": [
      "shuthelah_ephraim",
      "bered",
      "tahath_ephraim",
      "eleadah",
      "tahath2_ephraim",
      "zabad_ephraim",
      "shuthelah2_ephraim"
    ]
  },
  "shuthelah_ephraim": {
    "name": "Shuthelah (Ephraim's son)",
    "bio": "Son of Ephraim, founder of the Shuthelahite clan. Distinct from a later descendant also named Shuthelah.",
    "scripture": "Num 26:35-36; 1 Chr 7:20-21",
    "descendants": []
  },
  "bered": {
    "name": "Bered",
    "bio": "Descendant of Ephraim in the genealogical line.",
    "scripture": "1 Chr 7:20",
    "descendants": []
  },
  "tahath_ephraim": {
    "name": "Tahath (Ephraim's line)",
    "bio": "Descendant of Ephraim. There are two men named Tahath in this genealogy.",
    "scripture": "1 Chr 7:20",
    "descendants": []
  },
  "eleadah": {
    "name": "Eleadah (Eladah)",
    "bio": "Descendant of Ephraim, killed by men of Gath when raiding their livestock.",
    "scripture": "1 Chr 7:20-21",
    "descendants": []
  },
  "tahath2_ephraim": {
    "name": "Tahath (second)",
    "bio": "Another descendant of Ephraim with the same name, in the line leading to Joshua.",
    "scripture": "1 Chr 7:20",
    "descendants": []
  },
  "zabad_ephraim": {
    "name": "Zabad (Ephraim's line)",
    "bio": "Descendant of Ephraim, brother of Shuthelah (the younger). Distinct from other Zabads.",
    "scripture": "1 Chr 7:21",
    "descendants": []
  },
  "shuthelah2_ephraim": {
    "name": "Shuthelah (second)",
    "bio": "Later descendant of Ephraim with the same name as the earlier Shuthelah. Ancestor of Joshua.",
    "scripture": "1 Chr 7:20-21",
    "descendants": [
      "nun"
    ]
  },
  "nun": {
    "name": "Nun",
    "bio": "Father of Joshua from the tribe of Ephraim. Little else is known about him except his famous son who succeeded Moses.",
    "scripture": "Ex 33:11; Num 11:28; 13:8, 16; 14:6, 30, 38; 26:65; 27:18; 32:12, 28; 34:17; Deut 1:38; 31:23; 32:44; 34:9; Josh 1:1; 2:1, 23; 6:6; 14:1; 19:49, 51; 21:1; 24:29; Judg 2:8; 1 Kgs 16:34; 1 Chr 7:27; Neh 8:17",
    "descendants": [
      "joshua"
    ]
  },
  "joshua": {
    "name": "Joshua (Yeshua, Hoshea)",
    "bio": "Son of Nun from Ephraim. Moses' assistant and successor as Israel's leader. Original name Hoshea ('salvation'), Moses renamed him Joshua ('the LORD saves'). One of 12 spies; he and Caleb gave good report and were the only adults from Egypt to enter Canaan. Led Israel across Jordan, conquered Jericho and Canaan, divided the land. Rallied Israel: 'As for me and my household, we will serve the LORD.' Renewed covenant at Shechem. Lived 110 years. His name is the Hebrew form of Jesus. His life pictures Christ leading His people into rest.",
    "scripture": "Ex 17:9-14; 24:13; 32:17; 33:11; Num 11:28; 13:8, 16; 14:6, 30, 38; 26:65; 27:18-23; 32:12, 28; 34:17; Deut 1:38; 3:21, 28; 31:3, 7, 14, 23; 34:9; Josh 1:1-24:33; Judg 1:1; 2:6-23; 1 Sam 6:14, 18; 1 Kgs 16:34; 1 Chr 7:27; Neh 8:17; Ps 78:55; Hag 1:1, 12, 14; 2:2, 4; Zech 3:1-9; 6:11; Acts 7:45; Heb 4:8",
    "descendants": []
  },
  "benjamin": {
    "name": "Benjamin",
    "bio": "Twelfth and youngest son of Jacob, second son of Rachel. His name means 'son of my right hand' (Jacob renamed him from Ben-Oni, 'son of my sorrow,' given by dying Rachel). Born near Bethlehem; Rachel died in childbirth. Jacob's favorite after Joseph. Brothers were reluctant to take him to Egypt. Joseph tested them through him. His tribe was smallest but fierce—'a ravenous wolf.' Settled between Judah and Ephraim, including Jerusalem. Ehud, Saul, Jonathan, Esther, Mordecai, and Paul came from Benjamin. Remained loyal to Judah after the kingdom split. Nearly wiped out in civil war over the Levite's concubine.",
    "scripture": "Gen 35:16-24; 42:4-49:27; Ex 1:3; Num 1:11, 36-37; 26:38-41; Deut 27:12; 33:12; Josh 18:11-28; Judg 1:21; 5:14; 19:1-21:25; 1 Sam 9:1-2, 21; 10:20-21; 2 Sam 2:9, 15, 25, 31; 3:19; 4:2; 19:17; 21:14; 1 Kgs 12:21, 23; 15:22; 1 Chr 2:2; 7:6-12; 8:1-40; 9:3, 7; 12:2, 16, 29; 21:6; 27:21; 2 Chr 11:1-12, 23; 14:8; 15:2, 8-9; 17:17; 25:5; 31:1; 34:9, 32; Ezra 1:5; 4:1; 10:9; Neh 11:4, 7, 31-36; Esth 2:5; Ps 68:27; 80:2; Jer 6:1; 17:26; 32:8, 44; 33:13; 37:12-13; Ezek 48:23, 32; Obad 1:19; Phil 3:5; Rev 7:8",
    "descendants": [
      "bela_benjamin",
      "becher",
      "ashbel",
      "gera",
      "naaman_benjamin",
      "ehi",
      "rosh",
      "muppim",
      "huppim",
      "ard"
    ]
  },
  "bela_benjamin": {
    "name": "Bela (Benjamin's son)",
    "bio": "Firstborn son of Benjamin, founder of the Belaite clan. Had nine sons. Distinct from Bela son of Beor, king of Edom.",
    "scripture": "Gen 46:21; Num 26:38, 40; 1 Chr 7:6-7; 8:1, 3",
    "descendants": []
  },
  "becher": {
    "name": "Becher (Benjamin's son)",
    "bio": "Son of Benjamin, founder of the Bachrite clan. Had nine sons who were heads of families.",
    "scripture": "Gen 46:21; Num 26:35; 1 Chr 7:6, 8",
    "descendants": []
  },
  "ashbel": {
    "name": "Ashbel",
    "bio": "Son of Benjamin, founder of the Ashbelite clan.",
    "scripture": "Gen 46:21; Num 26:38; 1 Chr 8:1",
    "descendants": []
  },
  "gera": {
    "name": "Gera (Benjamin's line)",
    "bio": "Son of Benjamin. Several men named Gera appear in Benjamin's genealogy. Ehud the judge and Shimei who cursed David were descendants. The name appears multiple times, suggesting its popularity in Benjamin.",
    "scripture": "Gen 46:21; Judg 3:15; 2 Sam 16:5; 19:16, 18; 1 Chr 8:3, 5, 7",
    "descendants": [
      "ehud"
    ]
  },
  "ehud": {
    "name": "Ehud",
    "bio": "Son of Gera from Benjamin. Second judge of Israel, left-handed. Delivered Israel from Eglon king of Moab who oppressed them 18 years. Made a double-edged sword, strapped it to his right thigh. Told Eglon he had a secret message, then stabbed him; the fat closed over the blade. Escaped, rallied Israel, seized Jordan fords, killed 10,000 Moabites. The land had peace 80 years. His left-handedness was an advantage.",
    "scripture": "Judg 3:15-30",
    "descendants": []
  },
  "naaman_benjamin": {
    "name": "Naaman (Benjamin's line)",
    "bio": "Son of Benjamin, founder of the Naamite clan. Distinct from Naaman the Syrian commander.",
    "scripture": "Gen 46:21; Num 26:40; 1 Chr 8:4, 7",
    "descendants": []
  },
  "ehi": {
    "name": "Ehi (Ahiram)",
    "bio": "Son of Benjamin, founder of the Ahiramite clan. Also called Ahiram.",
    "scripture": "Gen 46:21; Num 26:38",
    "descendants": []
  },
  "rosh": {
    "name": "Rosh",
    "bio": "Son of Benjamin listed in Genesis. Not mentioned in later genealogies; may have died without descendants.",
    "scripture": "Gen 46:21",
    "descendants": []
  },
  "muppim": {
    "name": "Muppim (Shephupham)",
    "bio": "Son of Benjamin, founder of the Shuphamite clan. Also called Shephupham, Shuppim, and Shupham.",
    "scripture": "Gen 46:21; Num 26:39; 1 Chr 7:12, 15; 8:5",
    "descendants": []
  },
  "huppim": {
    "name": "Huppim (Hupham)",
    "bio": "Son of Benjamin, founder of the Huphamite clan. Also called Hupham.",
    "scripture": "Gen 46:21; Num 26:39; 1 Chr 7:12, 15",
    "descendants": []
  },
  "ard": {
    "name": "Ard (Addar)",
    "bio": "Son of Benjamin, founder of the Ardite clan. Also appears as Addar in some genealogies.",
    "scripture": "Gen 46:21; Num 26:40; 1 Chr 8:3",
    "descendants": []
  },
  "saul": {
    "name": "Saul",
    "bio": "Son of Kish from Benjamin, first king of Israel. Tall, handsome, reluctant leader. Anointed by Samuel after people demanded a king. Initially humble and successful, defeating Ammonites, Philistines, other enemies. Disobeyed God by not completely destroying Amalekites and their plunder, making excuse that people wanted to sacrifice. Samuel declared 'to obey is better than sacrifice' and told him the kingdom would be taken. David was anointed as his successor. Saul became jealous, repeatedly tried to kill David. Consulted a medium at Endor (forbidden). Wounded in battle with Philistines on Mount Gilboa, fell on his own sword. His reign showed the failure of man's choice vs. God's choice (David). Reigned 42 years.",
    "scripture": "1 Sam 9:1-31:13; 2 Sam 1:1-27; 2:4-8:12; 9:1-12; 12:7; 16:5-8; 19:17, 24; 21:1-14; 22:7; 1 Chr 5:10; 8:33; 9:39; 10:1-13; 11:2; 12:1-2, 19, 29; 13:3; 15:29; 26:28; 2 Chr 8:11; Ps 18 title; 52 title; 54 title; 57 title; 59 title; Isa 10:29; Acts 7:58; 8:1-3; 9:1-26; 11:25-30; 12:25; 13:1-23; 22:7, 13, 20; 26:14; Phil 3:5",
    "descendants": [
      "jonathan",
      "ishvi_saul",
      "malchishua",
      "merab",
      "michal"
    ]
  },
  "jonathan": {
    "name": "Jonathan",
    "bio": "Son of Saul, prince of Israel. Valiant warrior who defeated Philistine garrison at Geba. With only his armor-bearer, attacked Philistine outpost, killing 20 men, causing panic—God gave Israel victory. Nearly executed by Saul for tasting honey, unaware of Saul's rash oath. Made covenant with David, loved him as himself. Gave David his robe, armor, sword. Repeatedly defended David to Saul. Warned David of danger, helping him escape. Their friendship is Scripture's greatest example of loyal friendship. Died with Saul and two brothers at Mount Gilboa. David lamented: 'I grieve for you, Jonathan my brother; you were very dear to me. Your love for me was wonderful, more wonderful than that of women.' His son Mephibosheth was cared for by David.",
    "scripture": "1 Sam 13:2-14:49; 18:1-20:42; 23:16-18; 31:2; 2 Sam 1:4-27; 4:4; 9:1; 21:7; 1 Chr 8:33-34; 9:39-40; 10:2",
    "descendants": [
      "mephibosheth"
    ]
  },
  "mephibosheth": {
    "name": "Mephibosheth (Merib-Baal)",
    "bio": "Son of Jonathan, grandson of Saul. Was 5 when Saul and Jonathan died; his nurse dropped him fleeing the news, crippling both feet. Also called Merib-Baal. Lived in Lo Debar in obscurity. David sought him to show kindness for Jonathan's sake. Restored all Saul's land, ate at David's table like a son. His servant Ziba slandered him during Absalom's rebellion, but Mephibosheth remained loyal. He didn't groom himself the whole time David was exiled. When David returned, he divided the land between Mephibosheth and Ziba, though Mephibosheth said Ziba could have it all—he was just glad David returned safely. His son was Mica.",
    "scripture": "2 Sam 4:4; 9:1-13; 16:1-4; 19:24-30; 21:7-8; 1 Chr 8:34; 9:40",
    "descendants": [
      "mica"
    ]
  },
  "mica": {
    "name": "Mica (Mephibosheth's son)",
    "bio": "Son of Mephibosheth, great-grandson of Saul. Had four sons who continued Saul's line. Also called Micah.",
    "scripture": "2 Sam 9:12; 1 Chr 8:34-35; 9:40-41",
    "descendants": []
  },
  "ishvi_saul": {
    "name": "Ishvi (Ish-Bosheth, Esh-Baal)",
    "bio": "Son of Saul. Called by three names: Ishvi, Ish-Bosheth ('man of shame'), and Esh-Baal. After Saul's death, Abner made him king over Israel at 40 while David ruled Judah. Reigned 2 years. Weak ruler dominated by Abner. When he accused Abner over Saul's concubine, Abner defected to David. Two of Ish-Bosheth's own officers, Recab and Baanah, murdered him in his bed, cut off his head, brought it to David. David had them executed for killing an innocent man. With his death, all Israel accepted David as king.",
    "scripture": "1 Sam 14:49; 31:2; 2 Sam 2:8-4:12; 1 Chr 8:33; 9:39",
    "descendants": []
  },
  "amaziah": {
  "name": "Amaziah (Judah)",
  "bio": "Son of Joash, eleventh king of Judah. Became king at 25 and reigned 29 years in Jerusalem. Did what was right in the eyes of the LORD, though not wholeheartedly. Executed his father’s assassins but spared their children according to the Law of Moses. Raised a strong army and defeated Edom, renaming Sela to Joktheel. However, after victory, he brought back Edomite idols and worshiped them. Ignoring prophetic warning, he provoked King Jehoash of Israel and was defeated; Jerusalem’s wall was broken down and temple treasures seized. Later conspired against, he fled to Lachish, where he was killed. Buried in Jerusalem with his fathers.",
  "scripture": "2 Kgs 14:1–20; 2 Chr 25:1–28; Matt 1:9",
  "descendants": ["azariah_uzziah"]
},
  "azariah_uzziah": {
    "name": "Azariah (Uzziah)",
    "bio": "Son of Amaziah, twelfth king of Judah. Known both as Azariah and Uzziah. Became king at 16, reigned 52 years. Did right in the LORD's eyes. Sought God during Zechariah the prophet's life and God gave him success. Defeated Philistines, Arabs, and Meunites. Built towers, dug cisterns, had a large army. Famous throughout the region. But when strong, his pride led to destruction—he entered the temple to burn incense (reserved for priests). When confronted by 80 priests, he became angry, and God struck him with leprosy on his forehead. He remained leprous until death, living in isolation while his son Jotham governed.",
    "scripture": "2 Kgs 14:21-15:7; 1 Chr 3:12; 2 Chr 26:1-23; Isa 1:1; 6:1; 7:1; Hos 1:1; Amos 1:1; Zech 14:5; Matt 1:8-9",
    "descendants": [
      "jotham"
    ]
  },
  "jotham": {
    "name": "Jotham",
    "bio": "Son of Uzziah, thirteenth king of Judah. Became co-regent while his father had leprosy, then sole king at 25, reigning 16 years. Did right in the LORD's eyes but the people still acted corruptly. Built the Upper Gate of the temple, did extensive building on the wall and in cities. Grew powerful because he walked steadfastly before the LORD. Defeated the Ammonites and received tribute. Isaiah, Hosea, and Micah prophesied during his time. Unlike his father, he did not presume to enter the temple.",
    "scripture": "2 Kgs 15:5-38; 1 Chr 3:12; 5:17; 2 Chr 26:21-27:9; Isa 1:1; 7:1; Hos 1:1; Mic 1:1; Matt 1:9",
    "descendants": [
      "ahaz"
    ]
  },
  "ahaz": {
    "name": "Ahaz",
    "bio": "Son of Jotham, fourteenth king of Judah. Became king at 20, reigned 16 years. Did not do right like David; walked in ways of Israel's kings. Made cast images for Baals, burned incense in high places, even sacrificed his sons in fire. When attacked by Aram and Israel, he sought help from Assyria instead of God, giving temple and palace treasures. Assyria came but gave trouble, not help. He shut temple doors, set up altars on every Jerusalem corner and in every Judah town. Cut up temple furnishings. Extremely unfaithful in his distress. Not buried in the royal tombs. Isaiah confronted him; he refused to ask God for a sign.",
    "scripture": "2 Kgs 15:38-16:20; 17:1; 18:1; 20:11; 23:12; 1 Chr 3:13; 2 Chr 27:9-29:19; Isa 1:1; 7:1-14:28; 38:8; Hos 1:1; Mic 1:1; Matt 1:9",
    "descendants": [
      "hezekiah"
    ]
  },
  "hezekiah": {
    "name": "Hezekiah",
    "bio": "Son of Ahaz, fifteenth king of Judah. Became king at 25, reigned 29 years. One of Judah's greatest kings who 'trusted in the LORD...so that there was none like him among all the kings of Judah after him, nor among those before him.' In his first month, reopened and cleansed the temple, restored worship, celebrated Passover on grand scale. Broke sacred stones, cut down Asherah poles, destroyed bronze serpent Moses made (as people worshiped it). Rebelled against Assyria. When Sennacherib invaded, Hezekiah prayed; God sent an angel killing 185,000 Assyrians overnight. God added 15 years to his life after illness, showing the sun's shadow going backward as a sign. Received envoys from Babylon, showing them all his treasures—Isaiah prophesied Babylon would take it all. Built water tunnel. Father of wicked Manasseh.",
    "scripture": "2 Kgs 16:20-21:3; 1 Chr 3:13; 4:41; 2 Chr 28:27-33:1; Prov 25:1; Isa 1:1; 36:1-39:8; Jer 15:4; 26:18-19; Hos 1:1; Mic 1:1; Matt 1:9-10",
    "descendants": [
      "manasseh"
    ]
  },
  "manasseh": {
    "name": "Manasseh",
    "bio": "Son of Hezekiah, sixteenth king of Judah. Became king at 12, reigned 55 years (longest of any Judean king). Most wicked king: rebuilt high places his father destroyed, erected altars to Baal, made Asherah pole, worshiped starry hosts, built altars in the temple, sacrificed his sons in fire, practiced sorcery and divination, consulted mediums, set carved image in the temple. Led Judah to do more evil than the nations God destroyed. Shed much innocent blood, filling Jerusalem. God sent Assyrians who captured him with hooks, bound him in bronze, took him to Babylon. There he humbled himself and prayed; God heard and brought him back. He then removed foreign gods, repaired the altar. Too late—the damage was done; God determined to exile Judah. His evil made the exile inevitable.",
    "scripture": "2 Kgs 20:21-21:18; 23:12, 26; 24:3; 1 Chr 3:13; 2 Chr 32:33-33:20; Jer 15:4; Matt 1:10",
    "descendants": [
      "amon"
    ]
  },
  "amon": {
    "name": "Amon",
    "bio": "Son of Manasseh, seventeenth king of Judah. Became king at 22, reigned only 2 years. Did evil like his father Manasseh—worshiped and offered sacrifices to all the idols Manasseh had made. But unlike his father, he did not humble himself before the LORD; instead, Amon increased his guilt. His officials conspired against him and assassinated him in his palace. The people of the land then executed the conspirators and made his son Josiah king.",
    "scripture": "2 Kgs 21:18-26; 1 Chr 3:14; 2 Chr 33:20-25; Jer 1:2; 25:3; Zeph 1:1; Matt 1:10",
    "descendants": [
      "josiah"
    ]
  },
  "josiah": {
    "name": "Josiah",
    "bio": "Son of Amon, eighteenth king of Judah. Became king at 8, reigned 31 years. One of Judah's greatest kings who 'did right...walking in all the way of David.' At 16, began to seek God; at 20, began purging high places, Asherah poles, idols. At 26, repaired the temple—priest Hilkiah found the Book of the Law. When read to Josiah, he tore his robes, realizing how far Judah had strayed. Prophetess Huldah prophesied judgment but said Josiah would die in peace. He renewed the covenant, celebrated greatest Passover since Samuel, removed mediums, household gods, and all abominations. 'Before him there was no king like him who turned to the LORD with all his heart...nor did any like him arise after him.' Tragically, he fought Pharaoh Neco at Megiddo despite warning, was mortally wounded, and died. All Judah mourned. Jeremiah wrote laments for him.",
    "scripture": "1 Kgs 13:2; 2 Kgs 21:24-23:30; 1 Chr 3:14-15; 2 Chr 33:25-36:1; Jer 1:2-3; 22:11, 18; 25:1, 3; 26:1; 27:1; 35:1; 36:1-2, 9; 37:1; 45:1; 46:2; Zeph 1:1; Matt 1:10-11",
    "descendants": [
      "johanan_josiah",
      "jehoiakim",
      "zedekiah"
    ]
  },
  "johanan_josiah": {
    "name": "Johanan (Josiah's son)",
    "bio": "Firstborn son of Josiah. Nothing else is known about him; he did not reign, suggesting he died young or was passed over.",
    "scripture": "1 Chr 3:15",
    "descendants": []
  },
  "jehoiakim": {
    "name": "Jehoiakim (Eliakim)",
    "bio": "Son of Josiah, nineteenth king of Judah. Original name Eliakim, renamed by Pharaoh Neco who made him king at 25 (reigned 11 years) after deposing his brother Jehoahaz. Did evil. Became Nebuchadnezzar's vassal for 3 years, then rebelled. Oppressed people with forced labor to build his palace. When Jeremiah's scroll was read, he cut it up and burned it, showing contempt for God's word. Jeremiah prophesied he would have no one on David's throne and his body would be exposed. He died (possibly violently) and was buried with a donkey's burial. Left the kingdom in ruins for his son.",
    "scripture": "2 Kgs 23:34-24:6; 1 Chr 3:15-16; 2 Chr 36:4-8; Jer 1:3; 22:18-19; 24:1; 25:1; 26:1, 21-23; 27:1, 20; 28:4; 35:1; 36:1-32; 37:1; 45:1; 46:2; 52:2; Dan 1:1-2; Matt 1:11",
    "descendants": [
      "jehoiachin"
    ]
  },
  "jehoiachin": {
    "name": "Jehoiachin (Jeconiah, Coniah)",
    "bio": "Son of Jehoiakim, twentieth king of Judah. Also called Jeconiah and Coniah. Became king at 18, reigned 3 months. Did evil. Nebuchadnezzar besieged Jerusalem. Jehoiachin surrendered with his family. Taken to Babylon with nobles, warriors, craftsmen—10,000 captives. Only the poorest remained. Imprisoned 37 years until Evil-Merodach released him and gave him honor. Jeremiah cursed him: none of his descendants would prosper on David's throne. This created a legal problem for the Messiah being David's descendant, resolved by Jesus being Joseph's legal son (through Jeconiah's line) but Mary's biological son (through Nathan's line).",
    "scripture": "2 Kgs 24:6-25:30; 1 Chr 3:16-17; 2 Chr 36:8-9; Esth 2:6; Jer 22:24-30; 24:1; 27:20; 28:4; 29:1-2; 37:1; 52:31-34; Ezek 1:2; Matt 1:11-12; Luke 3:27",
    "descendants": [
      "shealtiel"
    ]
  },
  "shealtiel": {
    "name": "Shealtiel (Salathiel)",
    "bio": "Son of Jehoiachin, born in Babylonian exile. Also called Salathiel. Father (or possibly uncle) of Zerubbabel. The line from David to Christ continues through him despite his father's curse, showing God's sovereignty in preserving the messianic line even through judgment.",
    "scripture": "1 Chr 3:17; Ezra 3:2, 8; 5:2; Neh 12:1; Hag 1:1, 12, 14; 2:2, 23; Matt 1:12; Luke 3:27",
    "descendants": [
      "zerubbabel"
    ]
  },
  "zerubbabel": {
    "name": "Zerubbabel",
    "bio": "Son of Shealtiel (or possibly Pedaiah, Shealtiel's brother), grandson of Jehoiachin. Governor of Judah who led first return from Babylonian exile with High Priest Jeshua (Joshua). Laid foundation of second temple despite opposition. When work stopped due to opposition, prophets Haggai and Zechariah encouraged him. Completed the temple in 516 BC. Called God's 'signet ring,' reversing the curse on his grandfather Jeconiah. His name means 'seed of Babylon.' A remnant of David's royal line, he led the restoration. Some see him as a type of Christ. Both Matthew and Luke trace Jesus' genealogy through him, though through different sons.",
    "scripture": "1 Chr 3:19; Ezra 2:2; 3:2-8; 4:2-3; 5:2; Neh 7:7; 12:1, 47; Hag 1:1-2:23; Zech 4:6-10; Matt 1:12-13; Luke 3:27",
    "descendants": [
      "meshullam_zerubbabel",
      "hananiah_zerubbabel",
      "shelomith",
      "hashubah",
      "ohel",
      "berekiah",
      "hasadiah",
      "jushabhesed",
      "abiud"
    ]
  },
  "abiud": {
  "name": "Abiud",
  "bio": "Son of Zerubbabel. Ancestor of Jesus through the royal line recorded in Matthew’s genealogy. Continued the Davidic lineage after the Babylonian exile.",
  "scripture": "Matt 1:13",
  "descendants": ["eliakim_nt"]
},
"eliakim_nt": {
  "name": "Eliakim",
  "bio": "Son of Abiud, ancestor of Jesus Christ in the royal line preserved through Matthew’s genealogy.",
  "scripture": "Matt 1:13",
  "descendants": ["azor"]
},
"azor": {
  "name": "Azor",
  "bio": "Son of Eliakim, part of the Davidic line between the exile and Christ.",
  "scripture": "Matt 1:14",
  "descendants": ["zadok_nt"]
},
"zadok_nt": {
  "name": "Zadok",
  "bio": "Son of Azor, descendant of David through Solomon. Ancestor of Jesus Christ.",
  "scripture": "Matt 1:14",
  "descendants": ["achim"]
},
"achim": {
  "name": "Achim",
  "bio": "Son of Zadok, ancestor of Jesus Christ.",
  "scripture": "Matt 1:14",
  "descendants": ["eliud"]
},
"eliud": {
  "name": "Eliud",
  "bio": "Son of Achim, ancestor of Jesus Christ.",
  "scripture": "Matt 1:15",
  "descendants": ["eleazar_nt"]
},
"eleazar_nt": {
  "name": "Eleazar",
  "bio": "Son of Eliud, ancestor of Jesus Christ.",
  "scripture": "Matt 1:15",
  "descendants": ["matthan"]
},
"matthan": {
  "name": "Matthan",
  "bio": "Son of Eleazar, ancestor of Jesus Christ.",
  "scripture": "Matt 1:15",
  "descendants": ["jacob_nt"]
},
"jacob_nt": {
  "name": "Jacob",
  "bio": "Son of Matthan, father of Joseph, the legal father of Jesus Christ.",
  "scripture": "Matt 1:16",
  "descendants": ["joseph_nt"]
},
"joseph_nt": {
  "name": "Joseph",
  "bio": "Husband of Mary, legal father of Jesus Christ. A righteous man who obeyed God’s commands revealed through dreams, protecting Mary and the Christ Child.",
  "scripture": "Matt 1:16–25; Luke 1:27; 2:4–7",
  "descendants": ["jesus"]
},
  "meshullam_zerubbabel": {
    "name": "Meshullam (Zerubbabel's line)",
    "bio": "Son of Zerubbabel. One of seven children listed.",
    "scripture": "1 Chr 3:19",
    "descendants": []
  },
  "hananiah_zerubbabel": {
    "name": "Hananiah (Zerubbabel's line)",
    "bio": "Son of Zerubbabel. His descendants are traced for several more generations in 1 Chronicles.",
    "scripture": "1 Chr 3:19, 21",
    "descendants": []
  },
  "shelomith": {
    "name": "Shelomith (Zerubbabel's daughter)",
    "bio": "Daughter of Zerubbabel, sister to his sons.",
    "scripture": "1 Chr 3:19",
    "descendants": []
  },
  "hashubah": {
    "name": "Hashubah",
    "bio": "Son of Zerubbabel.",
    "scripture": "1 Chr 3:20",
    "descendants": []
  },
  "ohel": {
    "name": "Ohel",
    "bio": "Son of Zerubbabel.",
    "scripture": "1 Chr 3:20",
    "descendants": []
  },
  "berekiah": {
    "name": "Berekiah (Zerubbabel's son)",
    "bio": "Son of Zerubbabel. Distinct from other Berekiahs in Scripture.",
    "scripture": "1 Chr 3:20",
    "descendants": []
  },
  "hasadiah": {
    "name": "Hasadiah",
    "bio": "Son of Zerubbabel.",
    "scripture": "1 Chr 3:20",
    "descendants": []
  },
  "jushabhesed": {
    "name": "Jushab-Hesed",
    "bio": "Son of Zerubbabel. His name means 'mercy is restored.'",
    "scripture": "1 Chr 3:20",
    "descendants": []
  },
  "zedekiah": {
    "name": "Zedekiah (Mattaniah)",
    "bio": "Son of Josiah, twenty-first and last king of Judah. Original name Mattaniah, renamed by Nebuchadnezzar who made him king at 21 (reigned 11 years). Did evil. Rebelled against Babylon despite Jeremiah's warnings. Babylon besieged Jerusalem 2.5 years; the city fell. Zedekiah fled but was captured near Jericho. His sons were killed before his eyes, then his eyes were gouged out. He was bound in bronze chains and taken to Babylon where he died in prison. With him, the kingdom of Judah ended. Jerusalem and the temple were destroyed. The people were exiled. He was weak and did not heed Jeremiah, sealing Judah's fate.",
    "scripture": "2 Kgs 24:17-25:7; 1 Chr 3:15; 2 Chr 36:10-21; Jer 1:3; 21:1-7; 24:8; 27:3, 12; 28:1; 29:3; 32:1-5; 34:2-21; 37:1-38:28; 39:1-7; 44:30; 49:34; 51:59; 52:1-11",
    "descendants": []
  },
  "dan": {
    "name": "Dan",
    "bio": "Fifth son of Jacob by Bilhah (Rachel's servant). His name means 'judge' or 'he judged.' Rachel named him saying 'God has vindicated me.' Father of one son. His tribe settled in the north (originally allotted territory in the south but migrated). Jacob's blessing called him 'a serpent by the roadside.' Samson came from Dan's tribe. Later associated with idolatry, setting up golden calf at Dan. Omitted from some lists in Revelation, possibly due to later idolatry.",
    "scripture": "Gen 30:6; 35:25; 46:23; 49:16-17; Ex 1:4; Num 1:12, 38-39; 26:42-43; Deut 27:13; 33:22; Judg 13:2, 24; 18:1-31; 1 Chr 2:2; Ezek 48:1-2, 32",
    "descendants": [
      "hushim"
    ]
  },
  "hushim": {
    "name": "Hushim (Shuham)",
    "bio": "Only named son of Dan, founder of the Shuhamite clan. Also called Shuham.",
    "scripture": "Gen 46:23; Num 26:42",
    "descendants": []
  },
  "naphtali": {
    "name": "Naphtali",
    "bio": "Sixth son of Jacob by Bilhah (Rachel's servant). His name means 'my struggle.' Rachel named him saying 'I have had a great struggle with my sister, and I have won.' Father of four sons. His tribe settled in northern Galilee, beautiful and fertile land. Jacob's blessing called him 'a doe set free.' Deborah and Barak were from this tribe. Much of Jesus' ministry was in Naphtali's territory, fulfilling Isaiah's prophecy about Galilee.",
    "scripture": "Gen 30:8; 35:25; 46:24; 49:21; Ex 1:4; Num 1:15, 42-43; 26:48-50; Deut 27:13; 33:23; Judg 4:6, 10; 5:18; 1 Chr 2:2; 7:13; Isa 9:1; Matt 4:13-15",
    "descendants": [
      "jahzeel",
      "guni",
      "jezer",
      "shillem"
    ]
  },
  "jahzeel": {
    "name": "Jahzeel (Jahziel)",
    "bio": "Son of Naphtali, founder of the Jahzeelite clan.",
    "scripture": "Gen 46:24; Num 26:48; 1 Chr 7:13",
    "descendants": []
  },
  "guni": {
    "name": "Guni (Naphtali's line)",
    "bio": "Son of Naphtali, founder of the Gunite clan.",
    "scripture": "Gen 46:24; Num 26:48; 1 Chr 7:13",
    "descendants": []
  },
  "jezer": {
    "name": "Jezer",
    "bio": "Son of Naphtali, founder of the Jezerite clan.",
    "scripture": "Gen 46:24; Num 26:49; 1 Chr 7:13",
    "descendants": []
  },
  "shillem": {
    "name": "Shillem (Shallum)",
    "bio": "Son of Naphtali, founder of the Shillemite clan.",
    "scripture": "Gen 46:24; Num 26:49; 1 Chr 7:13",
    "descendants": []
  },
  "gad": {
    "name": "Gad",
    "bio": "Seventh son of Jacob by Zilpah (Leah's servant). His name means 'good fortune.' Leah named him saying 'What good fortune!' Father of seven sons. His tribe was known for warriors—they were 'brave warriors ready for battle.' Settled east of the Jordan. Jacob's blessing said 'Raiders will raid him, but he will raid at their heels.' Moses blessed them as lions. Elijah was from Gad's territory.",
    "scripture": "Gen 30:11; 35:26; 46:16; 49:19; Ex 1:4; Num 1:14, 24-25; 26:15-18; Deut 27:13; 33:20-21; Josh 13:24-28; 1 Chr 2:2; 5:11-22; 12:8-15",
    "descendants": [
      "ziphion",
      "haggi",
      "shuni",
      "ezbon",
      "eri",
      "arodi",
      "areli"
    ]
  },
  "ziphion": {
    "name": "Ziphion (Zephon)",
    "bio": "Son of Gad, founder of the Zephonite clan.",
    "scripture": "Gen 46:16; Num 26:15",
    "descendants": []
  },
  "haggi": {
    "name": "Haggi",
    "bio": "Son of Gad, founder of the Haggite clan.",
    "scripture": "Gen 46:16; Num 26:15",
    "descendants": []
  },
  "shuni": {
    "name": "Shuni",
    "bio": "Son of Gad, founder of the Shunite clan.",
    "scripture": "Gen 46:16; Num 26:15",
    "descendants": []
  },
  "ezbon": {
    "name": "Ezbon (Ozni)",
    "bio": "Son of Gad, founder of the Oznite clan. Also called Ozni.",
    "scripture": "Gen 46:16; Num 26:16",
    "descendants": []
  },
  "eri": {
    "name": "Eri",
    "bio": "Son of Gad, founder of the Erite clan.",
    "scripture": "Gen 46:16; Num 26:16",
    "descendants": []
  },
  "arodi": {
    "name": "Arodi (Arod)",
    "bio": "Son of Gad, founder of the Arodite clan.",
    "scripture": "Gen 46:16; Num 26:17",
    "descendants": []
  },
  "areli": {
    "name": "Areli",
    "bio": "Son of Gad, founder of the Arelite clan.",
    "scripture": "Gen 46:16; Num 26:17",
    "descendants": []
  },
  "asher": {
    "name": "Asher",
    "bio": "Eighth son of Jacob by Zilpah (Leah's servant). His name means 'happy' or 'blessed.' Leah said 'How happy I am! The women will call me happy.' Father of four sons and one daughter. His tribe received fertile coastal land known for olive oil. Jacob's blessing: 'His food will be rich; he will provide delicacies fit for a king.' Moses blessed them with security and strength. The prophetess Anna who recognized baby Jesus was from Asher.",
    "scripture": "Gen 30:13; 35:26; 46:17; 49:20; Ex 1:4; Num 1:13, 40-41; 26:44-47; Deut 27:13; 33:24-25; Josh 19:24-31; Judg 5:17; 1 Chr 2:2; 7:30-40; Luke 2:36",
    "descendants": [
      "imnah",
      "ishvah",
      "ishvi",
      "beriah",
      "serah"
    ]
  },
  "imnah": {
    "name": "Imnah (Jimna)",
    "bio": "Son of Asher, founder of the Imnite clan.",
    "scripture": "Gen 46:17; Num 26:44; 1 Chr 7:30",
    "descendants": []
  },
  "ishvah": {
    "name": "Ishvah (Isuah)",
    "bio": "Son of Asher. His clan is not mentioned in later lists.",
    "scripture": "Gen 46:17; 1 Chr 7:30",
    "descendants": []
  },
  "ishvi": {
    "name": "Ishvi (Isui)",
    "bio": "Son of Asher, founder of the Ishvite clan.",
    "scripture": "Gen 46:17; Num 26:44; 1 Chr 7:30",
    "descendants": []
  },
  "beriah": {
    "name": "Beriah (Asher's line)",
    "bio": "Son of Asher, founder of the Beriite clan. Father of Heber and Malchiel.",
    "scripture": "Gen 46:17; Num 26:44-45; 1 Chr 7:30-31",
    "descendants": [
      "heber_beriah",
      "malchiel"
    ]
  },
  "heber_beriah": {
    "name": "Heber (Beriah's son)",
    "bio": "Son of Beriah, grandson of Asher. Founder of the Heberite clan.",
    "scripture": "Gen 46:17; Num 26:45; 1 Chr 7:31-32",
    "descendants": []
  },
  "malchiel": {
    "name": "Malchiel",
    "bio": "Son of Beriah, grandson of Asher. Founder of the Malchielite clan. Father of Birzaith.",
    "scripture": "Gen 46:17; Num 26:45; 1 Chr 7:31",
    "descendants": []
  },
  "serah": {
    "name": "Serah",
    "bio": "Daughter of Asher, sister of his four sons. One of the few women mentioned in the tribal genealogies. Tradition says she lived a very long life and was among those who entered Egypt with Jacob and later left in the Exodus.",
    "scripture": "Gen 46:17; Num 26:46; 1 Chr 7:30",
    "descendants": []
  },
  "issachar": {
    "name": "Issachar",
    "bio": "Ninth son of Jacob by Leah (her fifth son). His name connects to 'reward' or 'wages.' Born after Leah gave her servant Zilpah to Jacob. Father of four sons. His tribe received fertile land in the Jezreel Valley. Jacob's blessing called him 'a rawboned donkey' who 'saw that a resting place was good... and bent his shoulder to the burden.' Known for understanding the times. Deborah called them for battle. King Baasha came from this tribe.",
    "scripture": "Gen 30:18; 35:23; 46:13; 49:14-15; Ex 1:3; Num 1:8, 28-29; 26:23-25; Deut 27:12; 33:18-19; Josh 19:17-23; Judg 5:15; 10:1; 1 Chr 2:1; 7:1-5; 12:32",
    "descendants": [
      "tola_issachar",
      "puvah",
      "job_issachar",
      "shimron"
    ]
  },
  "tola_issachar": {
    "name": "Tola (Issachar's line)",
    "bio": "Son of Issachar, founder of the Tolaite clan. Not to be confused with Tola the judge who came from this clan.",
    "scripture": "Gen 46:13; Num 26:23; 1 Chr 7:1-2",
    "descendants": []
  },
  "puvah": {
    "name": "Puvah (Puah, Pua)",
    "bio": "Son of Issachar, founder of the Punite clan. Also called Puah.",
    "scripture": "Gen 46:13; Num 26:23; 1 Chr 7:1",
    "descendants": []
  },
  "job_issachar": {
    "name": "Job (Issachar's line)",
    "bio": "Son of Issachar (also called Jashub), founder of the Jashubite clan. Distinct from Job of Uz.",
    "scripture": "Gen 46:13; Num 26:24; 1 Chr 7:1",
    "descendants": []
  },
  "shimron": {
    "name": "Shimron (Issachar's son)",
    "bio": "Son of Issachar, founder of the Shimronite clan.",
    "scripture": "Gen 46:13; Num 26:24; 1 Chr 7:1",
    "descendants": []
  },
  "zebulun": {
    "name": "Zebulun",
    "bio": "Tenth son of Jacob by Leah (her sixth son). His name means 'honor' or 'dwelling.' Leah said 'God has presented me with a precious gift. This time my husband will treat me with honor.' Father of three sons. His tribe received land from the Mediterranean to the Sea of Galilee. Jacob's blessing spoke of dwelling by seashore and ships. Moses blessed them for prosperity in trade. Zebulun and Naphtali risked their lives in Deborah's battle. Jesus grew up in Zebulun's territory, fulfilling Isaiah's prophecy.",
    "scripture": "Ex 6:23; Num 1:7; 2:3; 7:12, 17; 10:14; Ruth 4:19-20; 1 Chr 2:10; 6:22; Matt 1:4; Luke 3:33",
    "descendants": [
      "nahshon"
    ]
  },
  "nahshon": {
    "name": "Nahshon",
    "bio": "Son of Amminadab, leader of the tribe of Judah during the wilderness wanderings. Brother of Elisheba (Aaron's wife), making him Aaron's brother-in-law. His tribe presented the first offering at the dedication of the tabernacle. Led Judah's division in the march through the wilderness. Ancestor of David and Christ.",
    "scripture": "Ex 6:23; Num 1:7; 2:3; 7:12, 17; 10:14; Ruth 4:20; 1 Chr 2:10-11; Matt 1:4; Luke 3:32",
    "descendants": [
      "salmon"
    ]
  },
  "salmon": {
    "name": "Salmon (Salma)",
    "bio": "Son of Nahshon, married Rahab the harlot from Jericho. Father of Boaz. By marrying Rahab, he brought a Gentile convert into the line of the Messiah, foreshadowing the gospel's reach to all nations. Some traditions hold he was one of the spies Joshua sent to Jericho.",
    "scripture": "Ruth 4:20-21; 1 Chr 2:11, 51, 54; Matt 1:4-5; Luke 3:32",
    "descendants": [
      "boaz"
    ]
  },
  "boaz": {
    "name": "Boaz",
    "bio": "Son of Salmon and Rahab, wealthy landowner in Bethlehem from Judah's tribe. A man of noble character who showed great kindness to Ruth the Moabite widow. As kinsman-redeemer, he married Ruth after a nearer relative declined. His actions picture Christ as our Redeemer. Father of Obed, grandfather of Jesse, great-grandfather of David. His name means 'in him is strength.'",
    "scripture": "Ruth 2:1-4:22; 1 Chr 2:11-12; Matt 1:5; Luke 3:32",
    "descendants": [
      "obed"
    ]
  },
  "ruth": {
    "name": "Ruth",
    "bio": "A Moabite widow who showed faith and loyalty to Naomi. Redeemed by Boaz, she became the great-grandmother of King David.",
    "scripture": "Book of Ruth; Matthew 1:5",
    "descendants": [
      "obed"
    ]
  },
  "obed": {
    "name": "Obed",
    "bio": "Son of Boaz and Ruth, father of Jesse, grandfather of David. The women of Bethlehem said to Naomi that he would be 'a restorer of life and a nourisher of your old age.' His birth brought joy after tragedy. Through him the line of David continued, bringing both Ruth the Moabite and Rahab the Canaanite into the messianic lineage.",
    "scripture": "Ruth 4:17, 21-22; 1 Chr 2:12; Matt 1:5; Luke 3:32",
    "descendants": [
      "jesse"
    ]
  },
  "jesse": {
    "name": "Jesse",
    "bio": "Son of Obed, father of eight sons including David, and at least two daughters (Zeruiah and Abigail). Lived in Bethlehem. When Samuel came to anoint a king, Jesse presented seven sons but overlooked David. God chose David, the youngest shepherd. Jesse is called 'the Bethlehemite' and later 'the father of David.' Isaiah prophesied that a shoot would come from the stump of Jesse. Sent provisions to his sons in Saul's army, leading to David's encounter with Goliath. In his old age, David entrusted him to the king of Moab for safety.",
    "scripture": "Ruth 4:17, 22; 1 Sam 16:1-13, 18-22; 17:12-58; 20:27-31; 22:3-4; 25:10; 2 Sam 20:1; 23:1; 1 Kgs 12:16; 1 Chr 2:12-17; 10:14; 12:18; 29:26; 2 Chr 10:16; 11:18; Ps 72:20; Isa 11:1, 10; Matt 1:5-6; Luke 3:32; Acts 13:22; Rom 15:12",
    "descendants": [
      "eliab_jesse",
      "abinadab_jesse",
      "shammah_jesse",
      "nethaneel",
      "raddai",
      "ozem_jesse",
      "david",
      "zeruiah",
      "abigail_david"
    ]
  },
  "eliab_jesse": {
    "name": "Eliab (Jesse's son)",
    "bio": "Firstborn son of Jesse, impressive in appearance. When Samuel saw him, he thought surely this was the LORD's anointed, but God said He looks at the heart, not outward appearance. Later showed hostility toward his brother David when David came to the battle against Goliath. His daughter Abihail married Rehoboam.",
    "scripture": "1 Sam 16:6-7; 17:13, 28; 1 Chr 2:13; 27:18; 2 Chr 11:18",
    "descendants": []
  },
  "abinadab_jesse": {
    "name": "Abinadab (Jesse's son)",
    "bio": "Second son of Jesse. Passed over by Samuel when anointing the king. Served in Saul's army against the Philistines.",
    "scripture": "1 Sam 16:8; 17:13; 1 Chr 2:13",
    "descendants": []
  },
  "shammah_jesse": {
    "name": "Shammah (Jesse's son)",
    "bio": "Third son of Jesse (also called Shimea, Shimeah). Passed over by Samuel. Father of Jonathan who killed a giant. Served in Saul's army.",
    "scripture": "1 Sam 13:3; 16:9; 17:13; 2 Sam 13:3, 32; 21:21; 1 Chr 2:13; 20:7",
    "descendants": []
  },
  "nethaneel": {
    "name": "Nethaneel (Jesse's son)",
    "bio": "Fourth son of Jesse in 1 Chronicles genealogy.",
    "scripture": "1 Chr 2:14",
    "descendants": []
  },
  "raddai": {
    "name": "Raddai",
    "bio": "Fifth son of Jesse in 1 Chronicles genealogy.",
    "scripture": "1 Chr 2:14",
    "descendants": []
  },
  "ozem_jesse": {
    "name": "Ozem (Jesse's son)",
    "bio": "Sixth son of Jesse. Distinct from Ozem son of Jerahmeel.",
    "scripture": "1 Chr 2:15",
    "descendants": []
  },
  "zeruiah": {
    "name": "Zeruiah",
    "bio": "Daughter of Jesse, sister of David. Mother of three mighty warriors: Abishai, Joab, and Asahel. Her sons were fiercely loyal to David but also violent and difficult to control. Their father is not named; they are always identified as 'sons of Zeruiah.' She is mentioned frequently because of her sons' prominence.",
    "scripture": "1 Sam 26:6; 2 Sam 2:13, 18; 3:39; 8:16; 14:1; 16:9-10; 17:25; 18:2; 19:21-22; 21:17; 23:18, 37; 1 Kgs 1:7; 2:5, 22; 1 Chr 2:16; 11:6, 39; 18:12, 15; 26:28; 27:24",
    "descendants": [
      "abishai",
      "joab",
      "asahel"
    ]
  },
  "abishai": {
    "name": "Abishai",
    "bio": "Son of Zeruiah, nephew and mighty warrior of David. Volunteered to kill Saul when David spared him. Wanted to kill Shimei for cursing David. Chief of the Thirty, killed 300 men with his spear. Loyal to David through all rebellions. Fierce in battle, but David sometimes had to restrain his violence. Commanded troops under Joab. Saved David's life in battle against a giant.",
    "scripture": "1 Sam 26:6-9; 2 Sam 2:18, 24; 3:30; 10:10, 14; 16:9, 11; 18:2, 5, 12; 19:21; 20:6, 10; 21:17; 23:18-19; 1 Chr 2:16; 11:20-21; 18:12; 19:11, 15",
    "descendants": []
  },
  "joab": {
    "name": "Joab",
    "bio": "Son of Zeruiah, nephew of David. Commander of David's army throughout his reign. Brilliant military strategist who won many victories. Killed Abner in revenge for his brother Asahel's death. Killed Absalom against David's orders. Later killed Amasa. Murdered Uriah by proxy on David's order. Supported Adonijah over Solomon. Violent and ruthless but loyal to David. David's last instructions were that Solomon should not let him die in peace. Killed by Benaiah at the altar by Solomon's order.",
    "scripture": "2 Sam 2:13-3:39; 8:16; 10:7-14; 11:1-12:27; 14:1-33; 18:2-19:7; 20:4-23; 24:2-9; 1 Kgs 1:7-2:34; 11:15-16, 21; 1 Chr 2:16; 11:6, 8, 20, 26, 39; 18:15; 19:8-15; 20:1; 21:2-6; 26:28; 27:7, 24, 34",
    "descendants": []
  },
  "asahel": {
    "name": "Asahel",
    "bio": "Son of Zeruiah, youngest of the three brothers. One of David's thirty mighty men. Famous for being as swift as a wild gazelle. Pursued Abner after battle, refusing to turn aside. Abner killed him reluctantly in self-defense by a backward thrust of his spear. His death led Joab to later murder Abner in revenge. His son Zebadiah succeeded him as commander.",
    "scripture": "2 Sam 2:18-32; 3:27, 30; 23:24; 1 Chr 2:16; 11:26; 27:7",
    "descendants": []
  },
  "abigail_david": {
    "name": "Abigail (David's sister)",
    "bio": "Daughter of Jesse (or Nahash), sister of David and Zeruiah. Mother of Amasa, who briefly served as commander before being killed by Joab. Distinct from Abigail the wife of Nabal whom David married.",
    "scripture": "2 Sam 17:25; 1 Chr 2:16-17",
    "descendants": [
      "amasa"
    ]
  },
  "amasa": {
    "name": "Amasa",
    "bio": "Son of Abigail (David's sister) and Jether the Ishmaelite, making him David's nephew. Absalom made him commander during his rebellion instead of Joab. After Absalom's death, David forgave him and made him commander in place of Joab. While gathering troops, Joab deceitfully murdered him, ostensibly with a friendly greeting but stabbing him in the belly. His blood spilled on the highway, shocking those who saw.",
    "scripture": "2 Sam 17:25; 19:13; 20:4-12; 1 Kgs 2:5, 32; 1 Chr 2:17; 2 Chr 28:12",
    "descendants": []
  },
  "david": {
    "name": "David",
    "bio": "Youngest son of Jesse, second king of Israel, man after God's own heart. Anointed by Samuel while still a shepherd boy. Killed Goliath with a sling and stone. Best friend of Jonathan despite Saul's jealousy. Musician who soothed Saul and wrote many psalms. Mighty warrior who defeated Israel's enemies. United the twelve tribes and made Jerusalem the capital. Sinned with Bathsheba and murdered Uriah, but repented deeply. Received covenant that his throne would be established forever (fulfilled in Christ). Prophet, poet, warrior, and king. Died at 70 after reigning 40 years. Ancestor of Jesus Christ.",
    "scripture": "1 Sam 16-1 Kgs 2:11; 1 Chr 11-29; Psalms; Isa 9:7; 16:10-11; 55:3; Jer 23:5; 30:9; 33:15-22; Ezek 34:23-24; 37:24-25; Hos 3:5; Amos 9:11; Zech 12:8; Matt 1:1, 6, 17; 9:27; 12:3, 23; 15:22; 20:30-31; 21:9, 15; 22:42-45; Mark 2:25; 10:47-48; 11:10; 12:35-37; Luke 1:27, 32, 69; 2:4, 11; 3:31; 6:3; 18:38-39; 20:41-44; John 7:42; Acts 1:16; 2:25-36; 4:25; 7:45; 13:22-36; 15:16; Rom 1:3; 4:6; 11:9; 2 Tim 2:8; Heb 4:7; 11:32; Rev 3:7; 5:5; 22:16",
    "descendants": [
      "amnon",
      "absalom",
      "adonijah",
      "ithream",
      "solomon",
      "shammua",
      "shobab",
      "ibhar",
      "nepheg",
      "japhia",
      "eliada",
      "nathan"
    ]
  },
  "amnon": {
    "name": "Amnon",
    "bio": "Firstborn son of David by Ahinoam of Jezreel. Developed an obsessive infatuation with his half-sister Tamar. Following his friend Jonadab's wicked counsel, he pretended illness and raped Tamar, then immediately hated her intensely. David was furious but did not punish him. Two years later, Absalom avenged his sister by having his servants kill Amnon at a feast. His death as firstborn opened succession questions.",
    "scripture": "2 Sam 3:2; 13:1-39; 1 Chr 3:1",
    "descendants": []
  },
  "daniel_david": {
    "name": "Daniel (David's son)",
    "bio": "Second son of David by Abigail (widow of Nabal). Also called Chileab in 2 Samuel. Nothing else is recorded about him; he may have died young or been unfit for kingship.",
    "scripture": "2 Sam 3:3; 1 Chr 3:1",
    "descendants": []
  },
  "absalom": {
    "name": "Absalom",
    "bio": "Third son of David by Maacah, daughter of King Talmai of Geshur. Handsome without blemish, famous for his beautiful hair. Killed his brother Amnon for raping his sister Tamar, then fled for three years. After returning, he stole the hearts of Israel and rebelled against David, forcing him to flee Jerusalem. Absalom's rebellion ended when his hair caught in an oak tree during battle; Joab killed him despite David's orders to deal gently with him. David mourned intensely: 'O my son Absalom, my son, my son!' Had three sons who died young and a daughter named Tamar.",
    "scripture": "2 Sam 3:3; 13:1-14:33; 15:1-18:33; 19:1-10; 1 Kgs 1:6; 2:7, 28; 1 Chr 3:2; Ps 3 title",
    "descendants": [
      "tamar_absalom"
    ]
  },
  "tamar_absalom": {
    "name": "Tamar (Absalom's daughter)",
    "bio": "Daughter of Absalom, named after his violated sister. Described as beautiful. Married Uriel of Gibeah and bore Maacah, who became the favorite wife of King Rehoboam.",
    "scripture": "2 Sam 14:27; 1 Kgs 15:2; 2 Chr 11:20-22; 13:2",
    "descendants": []
  },
  "adonijah": {
    "name": "Adonijah",
    "bio": "Fourth son of David by Haggith. Very handsome, born after Absalom. When David was old, he exalted himself saying 'I will be king,' getting support from Joab and Abiathar. Nathan and Bathsheba informed David, who immediately had Solomon anointed king. Adonijah's supporters fled. Solomon spared him at first, but when Adonijah requested David's last nurse Abishag as wife (seen as a claim to the throne), Solomon had him executed by Benaiah.",
    "scripture": "2 Sam 3:4; 1 Kgs 1:5-2:25; 1 Chr 3:2",
    "descendants": []
  },
  "shephatiah_david": {
    "name": "Shephatiah (David's son)",
    "bio": "Fifth son of David by Abital. Born in Hebron. No other details recorded about him.",
    "scripture": "2 Sam 3:4; 1 Chr 3:3",
    "descendants": []
  },
  "ithream": {
    "name": "Ithream",
    "bio": "Sixth son of David by Eglah (called 'David's wife,' possibly another name for Michal or indicating she was his legitimate first wife). Born in Hebron. No further information given.",
    "scripture": "2 Sam 3:5; 1 Chr 3:3",
    "descendants": []
  },
  "shammua": {
    "name": "Shammua (David's son)",
    "bio": "Son of David born in Jerusalem to Bathsheba (also called Shimea). One of four sons by Bathsheba listed after David moved to Jerusalem.",
    "scripture": "2 Sam 5:14; 1 Chr 3:5; 14:4",
    "descendants": []
  },
  "shobab": {
    "name": "Shobab (David's son)",
    "bio": "Son of David born in Jerusalem to Bathsheba. Listed among the sons born after David captured Jerusalem.",
    "scripture": "2 Sam 5:14; 1 Chr 3:5; 14:4",
    "descendants": []
  },
  "nathan_david": {
  "name": "Nathan (David's son)",
  "bio": "Son of David and Bathsheba, born in Jerusalem. Brother of Solomon. Though Solomon inherited the throne, Nathan's line is recorded in Luke's genealogy of Jesus, possibly representing Mary's lineage. A prophet also named Nathan was David's contemporary but was a different person.",
  "scripture": "2 Sam 5:14; 1 Chr 3:5; 14:4; Zech 12:12; Luke 3:31",
  "descendants": [
    "mattatha",  
    "menna",
    "melea",
    "eliakim_luke",
    "jonan",
    "joseph_luke",
    "mary"  ]
},
"mattatha": {
  "name": "Mattatha",
  "bio": "Son of Nathan, descendant in the line of David recorded in Luke's genealogy.",
  "scripture": "Luke 3:31",
  "descendants": ["menna"]
},
"menna": {
  "name": "Menna",
  "bio": "Son of Mattatha, continued the line of Nathan in Luke's genealogy.",
  "scripture": "Luke 3:31",
  "descendants": ["melea"]
},
"melea": {
  "name": "Melea",
  "bio": "Son of Menna, part of Nathan’s line, continuing down the generations in Luke’s Gospel.",
  "scripture": "Luke 3:31",
  "descendants": ["eliakim_luke"]
},
"eliakim_luke": {
  "name": "Eliakim",
  "bio": "Son of Melea, one of the ancestors of Jesus Christ through Mary.",
  "scripture": "Luke 3:31",
  "descendants": ["jonan"]
},
"jonan": {
  "name": "Jonan",
  "bio": "Son of Eliakim, continuing the line of Nathan and David.",
  "scripture": "Luke 3:31",
  "descendants": ["joseph_luke"]
},
"joseph_luke": {
  "name": "Joseph (Luke's line)",
  "bio": "Husband of Mary, from the family of David through Nathan. He was the earthly father of Jesus, though not his biological father.",
  "scripture": "Luke 3:23-38",
  "descendants": ["mary"]
},
"mary": {
  "name": "Mary",
  "bio": "Mother of Jesus, the virgin who gave birth to the Messiah. Mary’s lineage traces back to David through Nathan, showing Jesus’ rightful claim to David’s throne.",
  "scripture": "Luke 1:26-38; Luke 3:31-38",
  "descendants": ["jesus"]
},
"jesus": {
  "name": "Jesus",
  "bio": "Son of God, born of Mary, fulfilling the prophecies of the Messiah. He is the King of Israel, descendant of David, through Nathan’s line, as well as the Son of God.",
  "scripture": "Matt 1:1-16; Luke 1:26-38; Luke 3:23-38"
},
  "ibhar": {
    "name": "Ibhar",
    "bio": "Son of David born in Jerusalem. Listed among David's sons but no details given.",
    "scripture": "2 Sam 5:15; 1 Chr 3:6; 14:5",
    "descendants": []
  },
  "elishama_david": {
    "name": "Elishama (David's son)",
    "bio": "Son of David born in Jerusalem. First of two sons with this name (the other also born in Jerusalem).",
    "scripture": "2 Sam 5:15; 1 Chr 3:6; 14:5",
    "descendants": []
  },
  "eliphelet_david": {
    "name": "Eliphelet (David's son)",
    "bio": "Son of David born in Jerusalem. First of two sons with this name.",
    "scripture": "2 Sam 5:15; 1 Chr 3:6; 14:5",
    "descendants": []
  },
  "nogah": {
    "name": "Nogah",
    "bio": "Son of David born in Jerusalem. Listed only in Chronicles.",
    "scripture": "1 Chr 3:7; 14:6",
    "descendants": []
  },
  "nepheg": {
    "name": "Nepheg (David's son)",
    "bio": "Son of David born in Jerusalem. Distinct from other Nephegs in Scripture.",
    "scripture": "2 Sam 5:15; 1 Chr 3:7; 14:6",
    "descendants": []
  },
  "japhia": {
    "name": "Japhia (David's son)",
    "bio": "Son of David born in Jerusalem. Not to be confused with King Japhia of Lachish in Joshua's time.",
    "scripture": "2 Sam 5:15; 1 Chr 3:7; 14:6",
    "descendants": []
  },
  "elishama2_david": {
    "name": "Elishama (second)",
    "bio": "Another son of David born in Jerusalem with the same name as an earlier son. This occurs in several cases among David's sons.",
    "scripture": "2 Sam 5:16; 1 Chr 3:8; 14:7",
    "descendants": []
  },
  "eliada": {
    "name": "Eliada (David's son)",
    "bio": "Son of David born in Jerusalem. Also called Beeliada, with the name changed to remove 'Baal.'",
    "scripture": "2 Sam 5:16; 1 Chr 3:8; 14:7",
    "descendants": []
  },
  "eliphelet2_david": {
    "name": "Eliphelet (second)",
    "bio": "Another son of David born in Jerusalem with the same name as an earlier son.",
    "scripture": "2 Sam 5:16; 1 Chr 3:8; 14:7",
    "descendants": []
  },
  "tamar_david": {
    "name": "Tamar (David's daughter)",
    "bio": "Daughter of David and Maacah, sister of Absalom, half-sister of Amnon. Beautiful and virgin. Amnon became obsessed with her and raped her after pretending to be ill. David was furious but took no action against Amnon. Absalom comforted her, telling her to be quiet about it, and she lived desolate in his house. Two years later, Absalom had Amnon killed in revenge.",
    "scripture": "2 Sam 13:1-32; 1 Chr 3:9",
    "descendants": []
  },
  "solomon": {
    "name": "Solomon",
    "bio": "Son of David and Bathsheba, third king of Israel. His name means 'peace' (also called Jedidiah, 'beloved of the LORD'). God appeared to him at Gibeon, offering anything; Solomon asked for wisdom. God gave him unparalleled wisdom, plus riches and honor. Built the magnificent temple in Jerusalem. Wrote Proverbs, Ecclesiastes, and Song of Solomon. Judged wisely (two mothers, one baby). Visited by Queen of Sheba. Tragic decline: married 700 wives and 300 concubines who turned his heart to idols. God told him the kingdom would be torn from his son. Reigned 40 years in peace and prosperity, but sowed seeds of division. The Davidic covenant continued through him to Christ.",
    "scripture": "2 Sam 5:14; 12:24-25; 1 Kgs 1-11; 1 Chr 3:5, 10; 14:4; 22:6-23:1; 28:5-29:28; 2 Chr 1-9; Ps 72 & 127 titles; Prov 1:1; 10:1; 25:1; Eccl 1:1, 12; Song 1:1; Jer 52:20; Matt 1:6-7; 6:29; 12:42; Luke 11:31; 12:27; John 10:23; Acts 3:11; 5:12; 7:47",
    "descendants": [
      "rehoboam"
    ]
  },
  "rehoboam": {
    "name": "Rehoboam",
    "bio": "Son of Solomon by Naamah an Ammonite, fourth king of Judah. When he became king at 41, the people asked for lighter burdens. Rejecting elders' counsel, he followed young advisers and threatened heavier burdens. This caused ten northern tribes to rebel under Jeroboam, splitting the kingdom. He reigned 17 years in Jerusalem. In his fifth year, Pharaoh Shishak invaded and took temple treasures. He did evil and did not set his heart to seek the LORD. Had 18 wives, 60 concubines, 28 sons, and 60 daughters. Fortified cities in Judah.",
    "scripture": "1 Kgs 11:43-14:31; 1 Chr 3:10; 2 Chr 9:31-13:7; Matt 1:7",
    "descendants": [
      "abijah_judah"
    ]
  },
  "abijah_judah": {
    "name": "Abijah (Judah)",
    "bio": "Son of Rehoboam by Maacah (Absalom's granddaughter), fifth king of Judah. Also called Abijam. Reigned 3 years in Jerusalem. Walked in his father's sins, but for David's sake, God gave him a lamp in Jerusalem. Fought against Jeroboam with a smaller army but won decisively because he relied on God. Had 14 wives, 22 sons, and 16 daughters. His heart was not fully devoted to the LORD like David's.",
    "scripture": "1 Kgs 14:31-15:8; 1 Chr 3:10; 2 Chr 11:20-14:1; Matt 1:7",
    "descendants": [
      "asa"
    ]
  },
  "asa": {
    "name": "Asa",
    "bio": "Son of Abijah, sixth king of Judah. Reigned 41 years, longest reign of early Judean kings. Did right in the LORD's eyes. Removed idols, high places, sacred stones, and Asherah poles. Deposed his grandmother Maacah for making an Asherah pole. Reformed worship and made a covenant to seek God. Defeated the Cushite army of one million. Later relied on Aram instead of God when threatened by Israel. Became diseased in his feet but sought physicians, not God. Died of the disease in his 41st year.",
    "scripture": "1 Kgs 15:8-24; 1 Chr 3:10; 2 Chr 14:1-16:14; Jer 41:9; Matt 1:7-8",
    "descendants": [
      "jehoshaphat"
    ]
  },
  "jehoshaphat": {
    "name": "Jehoshaphat",
    "bio": "Son of Asa, seventh king of Judah. Reigned 25 years. His name means 'the LORD judges.' Walked in godly ways, removed high places and Asherah poles, sent officials to teach the Law. God gave him great riches and honor. Made peace with Israel but unwisely allied with wicked Ahab, nearly dying in battle. Prophet Jehu rebuked him. Appointed judges throughout the land. Faced a vast army but sought God; after worship, God caused the enemies to destroy each other. Later allied with Ahaziah in shipping venture that God destroyed. Generally godly but compromised through alliances with wicked northern kings.",
    "scripture": "1 Kgs 15:24; 22:1-50; 2 Kgs 1:17; 3:1-27; 8:16; 12:18; 1 Chr 3:10; 2 Chr 17:1-21:1; Matt 1:8",
    "descendants": [
      "jehoram_judah"
    ]
  },
  "jehoram_judah": {
    "name": "Jehoram (Judah)",
    "bio": "Son of Jehoshaphat, eighth king of Judah. Married Athaliah, daughter of Ahab and Jezebel. Reigned 8 years. Walked in the ways of the kings of Israel and did evil. When he became king at 32, he killed all his brothers and some princes. Edom revolted successfully. God afflicted him with an incurable disease of the bowels. After two years of suffering, his bowels came out and he died in agony. His subjects did not make a fire in his honor, and he was not buried in the royal tombs.",
    "scripture": "1 Kgs 22:50; 2 Kgs 1:17; 8:16-24; 11:2; 12:18; 1 Chr 3:11; 2 Chr 21:1-20; Matt 1:8",
    "descendants": [
      "ahaziah_judah"
    ]
  },
  "ahaziah_judah": {
    "name": "Ahaziah (Judah)",
    "bio": "Son of Jehoram and Athaliah, ninth king of Judah (also called Jehoahaz and Azariah in some texts). Reigned one year. His mother was his counselor in doing evil. He was 22 when he began to reign. Walked in the ways of Ahab's house, as he was related through marriage. Went with Joram of Israel to fight Aram. While visiting wounded Joram, Jehu killed both kings, fulfilling prophecy against Ahab's house. Ahaziah fled but was shot, dying at Megiddo.",
    "scripture": "2 Kgs 8:24-9:29; 10:13; 11:1-2; 12:18; 13:1; 14:13; 1 Chr 3:11; 2 Chr 22:1-9; 25:23",
    "descendants": [
      "joash_judah"
    ]
  },
  "joash_judah": {
  "name": "Joash (Judah)",
  "bio": "Son of Ahaziah, tenth king of Judah (also called Jehoash). Hidden as an infant by his aunt Jehosheba when Athaliah sought to destroy the royal family. Crowned king at age seven under the guidance of the priest Jehoiada. During his early reign he did what was right in the eyes of the LORD, repairing the temple and restoring proper worship. However, after Jehoiada’s death, Joash turned to idolatry and ordered the stoning of Zechariah, Jehoiada’s son. As judgment, his officials conspired against him and killed him in the Millo. He was buried in the City of David but not in the royal tombs.",
  "scripture": "2 Kgs 11:2–12:21; 2 Chr 22:11–24:27; Matt 1:8",
  "descendants": ["amaziah"]
},
  "ahitub2": {
    "name": "Ahitub (second)",
    "bio": "Son of Amariah, high priest. Distinct from the earlier Ahitub who was father of Zadok.",
    "scripture": "1 Chr 6:11-12; Ezra 7:2",
    "descendants": [
      "zadok2"
    ]
  },
  "zadok2": {
    "name": "Zadok (second)",
    "bio": "Son of Ahitub, high priest. Distinct from the famous Zadok of David's time.",
    "scripture": "1 Chr 6:12; Ezra 7:2",
    "descendants": [
      "shallum_zadok"
    ]
  },
  "shallum_zadok": {
    "name": "Shallum (Zadok's line)",
    "bio": "Son of Zadok, high priest (also called Meshullam). Father of Hilkiah who served under King Josiah.",
    "scripture": "1 Chr 6:12-13; 9:11; Ezra 7:2; Neh 11:11",
    "descendants": [
      "hilkiah"
    ]
  },
  "hilkiah": {
    "name": "Hilkiah",
    "bio": "Son of Shallum, high priest under King Josiah. He discovered the Book of the Law in the temple during Josiah's reforms, which led to a great revival. He participated in the celebration of Passover. Father of Jeremiah the prophet (a different Hilkiah).",
    "scripture": "2 Kgs 22:4-23:24; 1 Chr 6:13; 9:11; 2 Chr 34:9-35:8; Ezra 7:1; Neh 11:11",
    "descendants": [
      "azariah_hilkiah"
    ]
  },
  "azariah_hilkiah": {
    "name": "Azariah (Hilkiah's line)",
    "bio": "Son of Hilkiah, high priest during the latter days of Judah.",
    "scripture": "1 Chr 6:13-14; 9:11; Ezra 7:1",
    "descendants": [
      "seraiah"
    ]
  },
  "seraiah": {
    "name": "Seraiah",
    "bio": "Son of Azariah, last high priest before the Babylonian exile. When Jerusalem fell to Nebuchadnezzar, he was taken to Riblah and executed. His son Jehozadak went into exile. Through Seraiah came the line to Ezra the scribe.",
    "scripture": "2 Kgs 25:18-21; 1 Chr 6:14; Ezra 7:1; Jer 52:24-27",
    "descendants": [
      "jehozadak"
    ]
  },
  "jehozadak": {
    "name": "Jehozadak (Jozadak)",
    "bio": "Son of Seraiah, high priest who went into Babylonian exile. Though he served as high priest in exile, he never returned to Jerusalem. His son Jeshua (Joshua) returned with Zerubbabel and served as high priest in the rebuilt temple.",
    "scripture": "1 Chr 6:14-15; Ezra 3:2, 8; 5:2; 10:18; Neh 12:26; Hag 1:1, 12, 14; 2:2, 4; Zech 6:11",
    "descendants": [
      "jeshua"
    ]
  },
  "jeshua": {
    "name": "Jeshua (Joshua)",
    "bio": "Son of Jehozadak, first high priest after the Babylonian exile. Returned from exile with Zerubbabel and led the rebuilding of the altar and temple. Worked alongside Zerubbabel to restore worship in Jerusalem despite opposition. Haggai and Zechariah prophesied to encourage him. Zechariah had a vision of him being cleansed and crowned, symbolic of the coming Messiah.",
    "scripture": "Ezra 2:2; 3:2-9; 4:3; 5:2; 10:18; Neh 7:7; 12:1, 7, 10, 26; Hag 1:1-2:23; Zech 3:1-10; 6:11",
    "descendants": []
  },
  "ithamar": {
    "name": "Ithamar",
    "bio": "Fourth and youngest son of Aaron. Unlike his older brothers Nadab and Abihu, he remained faithful. He and Eleazar became priests after their brothers' deaths. He oversaw the Gershonites and Merarites in carrying the tabernacle. Through him came the line of Eli. His descendants alternated with Eleazar's in the priestly divisions organized by David.",
    "scripture": "Ex 6:23; 28:1; Lev 10:6, 12, 16; Num 3:2-4; 4:28, 33; 7:8; 26:60; 1 Chr 6:3; 24:1-6",
    "descendants": [
      "eli"
    ]
  },
  "eli": {
    "name": "Eli",
    "bio": "High priest and judge of Israel for 40 years, descendant of Ithamar. He raised Samuel after Hannah dedicated him to the LORD. His own sons Hophni and Phinehas were wicked priests who dishonored God. He failed to restrain them, leading to judgment on his house. He fell backward and died when he heard the Ark was captured by the Philistines. God's judgment on his house fulfilled prophecy that the priesthood would be taken from Eli's line and given to a faithful priest (ultimately fulfilled in Zadok).",
    "scripture": "1 Sam 1:3-4:22; 14:3; 1 Kgs 2:27; Ps 99:6",
    "descendants": [
      "hophni",
      "phinehas_eli"
    ]
  },
  "hophni": {
    "name": "Hophni",
    "bio": "Son of Eli, wicked priest who served at Shiloh. He and his brother Phinehas treated the LORD's offering with contempt, taking meat by force and sleeping with women at the tabernacle entrance. Despite prophecies of judgment, they did not repent. Both were killed in battle when the Philistines captured the Ark of the Covenant.",
    "scripture": "1 Sam 1:3; 2:12-17, 22-25, 34; 4:4, 11, 17",
    "descendants": []
  },
  "phinehas_eli": {
    "name": "Phinehas (Eli's son)",
    "bio": "Son of Eli, wicked priest. Like his brother Hophni, he despised the LORD's offerings and committed sexual immorality at the tabernacle. His wife gave birth to Ichabod ('no glory') as he died and the Ark was captured. His death fulfilled God's judgment on Eli's house.",
    "scripture": "1 Sam 1:3; 2:12-17, 22-25, 34; 4:4, 11, 17-22",
    "descendants": [
      "ichabod"
    ]
  },
  "ichabod": {
    "name": "Ichabod",
    "bio": "Son of Phinehas, born on the day the Ark was captured, his father and grandfather Eli died, and the Philistines defeated Israel. His mother named him Ichabod ('no glory' or 'where is the glory?') declaring 'The glory has departed from Israel,' then died in childbirth. His name became a byword for the departure of God's presence.",
    "scripture": "1 Sam 4:19-22; 14:3",
    "descendants": []
  },
  "izhar": {
    "name": "Izhar",
    "bio": "Son of Kohath, father of Korah who led the rebellion against Moses. His other descendants included faithful Levites.",
    "scripture": "Ex 6:18, 21; Num 3:19, 27; 16:1; 1 Chr 6:2, 18, 38; 23:12, 18",
    "descendants": [
      "korah_izhar"
    ]
  },
  "korah_izhar": {
    "name": "Korah (Izhar's son)",
    "bio": "Son of Izhar, Levite from Kohath's clan. Led a rebellion against Moses and Aaron with 250 leaders, challenging their authority. God vindicated Moses by causing the earth to open and swallow Korah, Dathan, Abiram, and their families alive. Fire consumed the 250 leaders. Surprisingly, 'the sons of Korah did not die' and became famous psalm writers. His rebellion became a warning against presumption.",
    "scripture": "Ex 6:21, 24; Num 16:1-17:13; 26:9-11; 27:3; Jude 1:11",
    "descendants": [
      "assir_korah",
      "elkanah_korah",
      "abiasaph"
    ]
  },
  "assir_korah": {
    "name": "Assir (Korah's line)",
    "bio": "Son of Korah who did not die in the rebellion. His descendants became temple musicians and wrote many psalms.",
    "scripture": "Ex 6:24; 1 Chr 6:22-23, 37",
    "descendants": []
  },
  "elkanah_korah": {
    "name": "Elkanah (Korah's line)",
    "bio": "Son of Korah who survived the rebellion. Part of the Korahite line that served in temple worship.",
    "scripture": "Ex 6:24; 1 Chr 6:23, 25-27, 33-34",
    "descendants": []
  },
  "abiasaph": {
    "name": "Abiasaph (Ebiasaph)",
    "bio": "Son of Korah who survived. His descendants became gatekeepers and musicians in the temple. Also called Ebiasaph.",
    "scripture": "Ex 6:24; 1 Chr 6:23, 37; 9:19",
    "descendants": []
  },
  "hebron_kohath": {
    "name": "Hebron (Kohath's line)",
    "bio": "Son of Kohath, head of the Hebronite clan among the Levites.",
    "scripture": "Ex 6:18; Num 3:19, 27; 1 Chr 6:2, 18; 23:12, 19; 26:23, 30-31",
    "descendants": []
  },
  "uzziel_kohath": {
    "name": "Uzziel (Kohath's line)",
    "bio": "Son of Kohath, head of the Uzzielite clan among the Levites. His descendants had various temple duties.",
    "scripture": "Ex 6:18, 22; Lev 10:4; Num 3:19, 27, 30; 1 Chr 6:2, 18; 23:12, 20; 24:24",
    "descendants": []
  },
  "moses": {
    "name": "Moses",
    "bio": "Son of Amram and Jochebed, brother of Aaron and Miriam. Greatest prophet and lawgiver of Israel. Drawn from the Nile by Pharaoh's daughter, raised in Egypt's court. Fled to Midian after killing an Egyptian, where God called him from the burning bush. Led Israel out of Egypt through ten plagues and the Red Sea crossing. Received the Law on Mount Sinai. Interceded repeatedly for rebellious Israel. Not permitted to enter the Promised Land for striking the rock. Saw the land from Mount Nebo and died there at age 120. God buried him in an unknown location. His face shone after speaking with God.",
    "scripture": "Ex 2:1-Deut 34:12; Josh 1:1-2; 1 Sam 12:6, 8; Ps 77:20; 90:1; 99:6; 103:7; 105:26; 106:16, 23, 32; Isa 63:11-12; Jer 15:1; Mic 6:4; Mal 4:4; Matt 17:3-4; 19:7-8; 23:2; Mark 9:4-5; Luke 9:30, 33; 16:29, 31; 24:27, 44; John 1:17, 45; 3:14; 5:45-46; 6:32; 7:19, 22-23; 9:28-29; Acts 3:22; 7:20-44; 13:39; 15:1, 21; 26:22; 28:23; Rom 5:14; 9:15; 10:5, 19; 1 Cor 9:9; 10:2; 2 Cor 3:7-15; 2 Tim 3:8; Heb 3:2-16; 7:14; 8:5; 9:19; 10:28; 11:23-29; 12:21; Jude 1:9; Rev 15:3",
    "descendants": [
      "gershom_moses",
      "eliezer_moses"
    ]
  },
  "gershom_moses": {
    "name": "Gershom (Moses' son)",
    "bio": "Firstborn son of Moses and Zipporah, born in Midian. His name means 'sojourner there,' reflecting Moses' statement 'I have been a sojourner in a foreign land.' His descendants became Levites, with one (Jonathan) becoming a priest at Dan, though this was irregular.",
    "scripture": "Ex 2:22; 18:3; Judg 18:30; 1 Chr 23:15-16; 26:24",
    "descendants": [
      "jonathan_gershom"
    ]
  },
  "jonathan_gershom": {
    "name": "Jonathan (Gershom's line)",
    "bio": "Descendant of Moses (some texts say descendant of Manasseh to avoid embarrassment). He became priest for the tribe of Dan's idolatrous shrine at Laish, a negative example in Judges. His descendants continued as priests there until the exile.",
    "scripture": "Judg 18:30",
    "descendants": []
  },
  "eliezer_moses": {
    "name": "Eliezer (Moses' son)",
    "bio": "Second son of Moses and Zipporah. His name means 'My God is help,' reflecting Moses' gratitude: 'The God of my father was my help, and delivered me from the sword of Pharaoh.' His descendants became Levitical officials.",
    "scripture": "Ex 18:4; 1 Chr 23:15, 17; 26:25",
    "descendants": [
      "rehabiah"
    ]
  },
  "rehabiah": {
    "name": "Rehabiah",
    "bio": "Son of Eliezer, grandson of Moses. Though Eliezer had only one named son, Rehabiah had many descendants who served as Levitical officials.",
    "scripture": "1 Chr 23:17; 24:21; 26:25",
    "descendants": []
  },
  "miriam": {
    "name": "Miriam",
    "bio": "Daughter of Amram and Jochebed, sister of Moses and Aaron. A prophetess who watched over baby Moses in the Nile and suggested their mother as his nurse. Led the women in song and dance after crossing the Red Sea. Later challenged Moses' authority with Aaron and was struck with leprosy for seven days until Moses interceded. She died and was buried at Kadesh in the wilderness. One of the three leaders God sent before Israel.",
    "scripture": "Ex 2:4-8; 15:20-21; Num 12:1-15; 20:1; 26:59; Deut 24:9; 1 Chr 6:3; Mic 6:4",
    "descendants": []
  },
  "merari": {
    "name": "Merari",
    "bio": "Third son of Levi. His descendants formed one of the three main Levitical clans, responsible for the frames, bars, pillars, and bases of the tabernacle—the structural framework. They camped north of the tabernacle and received four carts and eight oxen for transport.",
    "scripture": "Gen 46:11; Ex 6:16, 19; Num 3:17, 20, 33-37; 4:29-45; 7:8; 10:17; 26:57; Josh 21:7, 34-40; 1 Chr 6:1, 16, 19, 29, 44, 47, 63, 77; 9:14; 15:6; 23:6, 21-23; 24:26-27; 26:10, 19; Ezra 8:19",
    "descendants": [
      "mahli",
      "mushi"
    ]
  },
  "mahli": {
    "name": "Mahli",
    "bio": "Son of Merari, head of the Mahlite clan of Levites who served in the tabernacle and temple.",
    "scripture": "Ex 6:19; Num 3:20, 33; 26:58; 1 Chr 6:19, 29; 23:21; 24:26, 28; Ezra 8:18",
    "descendants": []
  },
  "mushi": {
    "name": "Mushi",
    "bio": "Son of Merari, head of the Mushite clan of Levites. His descendants served in various capacities in worship and temple maintenance.",
    "scripture": "Ex 6:19; Num 3:20, 33; 26:58; 1 Chr 6:19, 47; 23:21, 23; 24:26, 30",
    "descendants": []
  },
  "judah": {
    "name": "Judah",
    "bio": "Fourth son of Jacob by Leah. His name means 'praise.' Initially suggested selling Joseph into slavery. Later offered himself as substitute for Benjamin in Egypt, showing transformation. Father of twins Perez and Zerah by Tamar (his daughter-in-law). Received the greatest blessing from Jacob: the scepter would not depart from Judah until Shiloh (Messiah) comes. His tribe became the royal tribe, through which came David and ultimately Christ. The southern kingdom was named after him.",
    "scripture": "Gen 29:35; 35:23; 37:26-27; 38:1-30; 43:3-10; 44:14-34; 46:12, 28; 49:8-12; Ex 1:2; Num 1:7, 26-27; 26:19-22; Deut 33:7; Ruth 4:12; 1 Chr 2:1-4:23; 5:2; Matt 1:2-3; Luke 3:33; Heb 7:14; Rev 5:5",
    "descendants": [
      "er",
      "onan",
      "shelah_judah",
      "perez",
      "zerah_judah"
    ]
  },
  "er": {
    "name": "Er",
    "bio": "Firstborn son of Judah by his Canaanite wife Shua. He married Tamar but was wicked in the LORD's sight, so God put him to death before he had children. His death set in motion the account of Judah and Tamar.",
    "scripture": "Gen 38:3, 6-7; 46:12; Num 26:19; 1 Chr 2:3",
    "descendants": []
  },
  "onan": {
    "name": "Onan",
    "bio": "Second son of Judah. Following levirate marriage law, he was to raise up offspring for his dead brother Er through Tamar. However, he deliberately prevented pregnancy to avoid giving his brother an heir. This wickedness displeased the LORD, who put him to death as well.",
    "scripture": "Gen 38:4, 8-10; 46:12; Num 26:19; 1 Chr 2:3",
    "descendants": []
  },
  "shelah_judah": {
    "name": "Shelah (Judah's son)",
    "bio": "Third son of Judah by his Canaanite wife. Judah promised him to Tamar but failed to give him to her when he grew up, fearing he would die like his brothers. His descendants formed a clan in Judah.",
    "scripture": "Gen 38:5, 11, 14, 26; 46:12; Num 26:20; 1 Chr 2:3; 4:21-23",
    "descendants": []
  },
  "zerah_judah": {
    "name": "Zerah (Judah's line)",
    "bio": "Twin son of Judah and Tamar. During birth, he put out his hand first and received a scarlet thread, but then drew back and Perez was born first. His descendants included wise men like Ethan and Heman, and Achan who troubled Israel. The royal line came through his twin Perez, not him.",
    "scripture": "Gen 38:28-30; 46:12; Num 26:20; Josh 7:1, 18, 24; 22:20; 1 Chr 2:4, 6; 9:6; Neh 11:24; Matt 1:3",
    "descendants": [
      "zimri_zerah",
      "ethan",
      "heman_zerah",
      "calcol",
      "dara"
    ]
  },
  "zimri_zerah": {
    "name": "Zimri (Zerah's line)",
    "bio": "Son of Zerah, father of Carmi. Through Carmi came Achan who took devoted things at Jericho.",
    "scripture": "Josh 7:1; 1 Chr 2:6",
    "descendants": [
      "carmi_zimri"
    ]
  },
  "carmi_zimri": {
    "name": "Carmi (Zimri's line)",
    "bio": "Son of Zimri, father of Achan (also called Achar). Distinct from other Carmis.",
    "scripture": "Josh 7:1, 18; 1 Chr 2:7; 4:1",
    "descendants": [
      "achan"
    ]
  },
  "achan": {
    "name": "Achan (Achar)",
    "bio": "Son of Carmi from the tribe of Judah. Disobeyed God's command by taking devoted plunder from Jericho (a beautiful robe, silver, and gold), hiding it in his tent. His sin caused Israel's defeat at Ai and the death of 36 men. Discovered by lot, he confessed and was stoned to death with his family in the Valley of Achor. His name means 'trouble' and he is remembered as the one 'who brought trouble on Israel.'",
    "scripture": "Josh 7:1-26; 22:20; 1 Chr 2:7",
    "descendants": []
  },
  "ethan": {
    "name": "Ethan the Ezrahite",
    "bio": "Son of Zerah, a wise man whose wisdom was surpassed only by Solomon's. Credited with writing Psalm 89. He and his brothers were famous for their wisdom.",
    "scripture": "1 Kgs 4:31; 1 Chr 2:6; Ps 89 title",
    "descendants": []
  },
  "heman_zerah": {
    "name": "Heman (Zerah's line)",
    "bio": "Son of Zerah, a wise man whose wisdom was compared to Solomon's. Credited with writing Psalm 88. Not to be confused with Heman the musician who descended from Kohath.",
    "scripture": "1 Kgs 4:31; 1 Chr 2:6; Ps 88 title",
    "descendants": []
  },
  "calcol": {
    "name": "Calcol",
    "bio": "Son of Zerah, one of the wise men whose wisdom was surpassed by Solomon.",
    "scripture": "1 Kgs 4:31; 1 Chr 2:6",
    "descendants": []
  },
  "dara": {
    "name": "Dara (Darda)",
    "bio": "Son of Zerah, one of the wise men whose wisdom was exceeded by Solomon's.",
    "scripture": "1 Kgs 4:31; 1 Chr 2:6",
    "descendants": []
  },
  "perez": {
    "name": "Perez",
    "bio": "Twin son of Judah and Tamar (his daughter-in-law), born before his twin Zerah. His birth came through unusual circumstances when Tamar disguised herself after Judah failed to give her Shelah as promised. Though the circumstances were irregular, God used this line for the royal lineage. Through Perez came Boaz, Jesse, David, and ultimately Christ. His name means 'breach' or 'breakthrough.'",
    "scripture": "Gen 38:27-29; 46:12; Num 26:20-21; Ruth 4:12, 18-22; 1 Chr 2:4-5; 4:1; 9:4; 27:3; Neh 11:4-6; Matt 1:3; Luke 3:33",
    "descendants": [
      "hezron_judah",
      "hamul"
    ]
  },
  "hamul": {
    "name": "Hamul",
    "bio": "Son of Perez, founder of the Hamulite clan in Judah.",
    "scripture": "Gen 46:12; Num 26:21; 1 Chr 2:5",
    "descendants": []
  },
  "hezron_judah": {
    "name": "Hezron (Judah's line)",
    "bio": "Son of Perez, went to Egypt with Jacob. His line split: through Ram came David and the kings; through Caleb came mighty warriors. He married a daughter of Machir (Manasseh's son) late in life. Lived 60+ years. A key link between Judah and David.",
    "scripture": "Gen 46:12; Ex 6:14; Num 26:6, 21; Ruth 4:18-19; 1 Chr 2:5, 9, 18, 21, 24-25; 4:1; Matt 1:3; Luke 3:33",
    "descendants": [
      "ram",
      "caleb",
      "jerahmeel"
    ]
  },
  "caleb": {
    "name": "Caleb (Hezron's son)",
    "bio": "Son of Hezron (distinct from Caleb the spy). Father of Hur. His descendants included important figures in Judah's genealogy.",
    "scripture": "1 Chr 2:18-20, 42-50; 4:15",
    "descendants": [
      "hur",
      "mareshah"
    ]
  },
  "hur": {
    "name": "Hur",
    "bio": "Son of Caleb, grandson of Hezron. He and Aaron held up Moses' hands during the battle with Amalek. Left in charge with Aaron when Moses went up Mount Sinai. Grandfather of Bezalel, the master craftsman of the tabernacle.",
    "scripture": "Ex 17:10, 12; 24:14; 31:2; 35:30; 38:22; 1 Chr 2:19-20; 4:1, 4; 2 Chr 1:5",
    "descendants": [
      "uri"
    ]
  },
  "uri": {
    "name": "Uri",
    "bio": "Son of Hur, father of Bezalel the master craftsman.",
    "scripture": "Ex 31:2; 35:30; 38:22; 1 Chr 2:20; 2 Chr 1:5",
    "descendants": [
      "bezalel"
    ]
  },
  "bezalel": {
    "name": "Bezalel",
    "bio": "Son of Uri, great-grandson of Hezron. Chosen and filled by God's Spirit with skill, intelligence, and knowledge in all craftsmanship. Master builder of the tabernacle, ark of the covenant, and all its furnishings. First person in Scripture said to be filled with the Spirit. Worked with Oholiab and taught others. His name means 'in the shadow/protection of God.'",
    "scripture": "Ex 31:1-11; 35:30-36:2; 37:1-38:23; 1 Chr 2:20; 2 Chr 1:5",
    "descendants": []
  },
  "mareshah": {
    "name": "Mareshah",
    "bio": "Son of Caleb, father of Hebron in Judah's genealogy.",
    "scripture": "1 Chr 2:42",
    "descendants": []
  },
  "jerahmeel": {
    "name": "Jerahmeel",
    "bio": "Firstborn son of Hezron, brother of Ram (David's ancestor) and Caleb. His descendants formed a clan (Jerahmeelites) in southern Judah.",
    "scripture": "1 Chr 2:9, 25-33, 42",
    "descendants": [
      "ram_jerahmeel",
      "bunah",
      "oren",
      "ozem_jerahmeel",
      "ahijah_jerahmeel"
    ]
  },
  "ram_jerahmeel": {
    "name": "Ram (Jerahmeel's line)",
    "bio": "Firstborn son of Jerahmeel. Distinct from Ram the ancestor of David.",
    "scripture": "1 Chr 2:25, 27",
    "descendants": []
  },
  "bunah": {
    "name": "Bunah",
    "bio": "Son of Jerahmeel.",
    "scripture": "1 Chr 2:25",
    "descendants": []
  },
  "oren": {
    "name": "Oren",
    "bio": "Son of Jerahmeel.",
    "scripture": "1 Chr 2:25",
    "descendants": []
  },
  "ozem_jerahmeel": {
    "name": "Ozem (Jerahmeel's line)",
    "bio": "Son of Jerahmeel. Distinct from Ozem, son of Jesse.",
    "scripture": "1 Chr 2:25",
    "descendants": []
  },
  "ahijah_jerahmeel": {
    "name": "Ahijah (Jerahmeel's line)",
    "bio": "Son of Jerahmeel.",
    "scripture": "1 Chr 2:25",
    "descendants": []
  },
  "ram": {
    "name": "Ram (David's ancestor)",
    "bio": "Son of Hezron, father of Amminadab. Direct ancestor of King David in the royal line. Also called Aram in some translations. Through him the covenant promises to Judah were passed down.",
    "scripture": "Ruth 4:19; 1 Chr 2:9-10; Matt 1:3-4; Luke 3:33",
    "descendants": [
      "amminadab"
    ]
  },
  "amminadab": {
    "name": "Amminadab",
    "bio": "Son of Ram, father of Nahshon. Ancestor of David and Jesus in the royal lineage. His daughter Elisheba married Aaron, the brother of Moses, linking the royal and priestly lines of Israel.",
    "scripture": "Exod 6:23; Num 1:7; Ruth 4:19-20; Matt 1:4",
    "descendants": [
      "nahshon"
    ]
  },
  "cain": {
    "name": "Cain",
    "bio": "Firstborn son of Adam and Eve. A farmer who brought an offering of crops to God, which was not accepted. In jealousy, he murdered his brother Abel, becoming the first murderer. God marked him and sent him to wander in the land of Nod, east of Eden, where he built a city named after his son Enoch.",
    "scripture": "Gen 4:1-17, 25; Heb 11:4; 1 John 3:12; Jude 1:11",
    "descendants": [
      "enoch_cain"
    ]
  },
  "abel": {
    "name": "Abel",
    "bio": "Second son of Adam and Eve. A shepherd who brought the firstborn of his flock as an offering to God, which was accepted. He was murdered by his brother Cain out of jealousy. Abel is remembered as the first martyr and a man of faith whose blood cried out from the ground.",
    "scripture": "Gen 4:2-10, 25; Matt 23:35; Luke 11:51; Heb 11:4; 12:24",
    "descendants": []
  },
  "enoch_cain": {
    "name": "Enoch (Cain's line)",
    "bio": "Son of Cain, after whom Cain named the first city he built. This Enoch is distinct from the righteous Enoch in Seth's line who walked with God.",
    "scripture": "Gen 4:17-18",
    "descendants": [
      "irad"
    ]
  },
  "irad": {
    "name": "Irad",
    "bio": "Son of Enoch in Cain's genealogical line. Little else is recorded about him.",
    "scripture": "Gen 4:18",
    "descendants": [
      "mehujael"
    ]
  },
  "mehujael": {
    "name": "Mehujael",
    "bio": "Descendant of Cain through Irad. Part of the ungodly line that did not call upon the name of the LORD.",
    "scripture": "Gen 4:18",
    "descendants": [
      "methushael"
    ]
  },
  "methushael": {
    "name": "Methushael",
    "bio": "Father of Lamech in Cain's genealogical line. His name is similar to Methuselah in Seth's line.",
    "scripture": "Gen 4:18",
    "descendants": [
      "lamech_cain"
    ]
  },
  "lamech_cain": {
    "name": "Lamech (Cain's line)",
    "bio": "Descendant of Cain who took two wives (Adah and Zillah), becoming the first recorded polygamist. He boasted of killing a young man who wounded him and claimed greater vengeance than Cain. His children became founders of various crafts and arts.",
    "scripture": "Gen 4:18-24",
    "descendants": [
      "jabal",
      "jubal",
      "tubalcain",
      "naamah"
    ]
  },
  "jabal": {
    "name": "Jabal",
    "bio": "Son of Lamech and Adah. He was the father of those who dwell in tents and have livestock, essentially the ancestor of nomadic herdsmen and pastoral culture.",
    "scripture": "Gen 4:20",
    "descendants": []
  },
  "jubal": {
    "name": "Jubal",
    "bio": "Son of Lamech and Adah, brother of Jabal. He was the father of all who play the harp and flute, making him the ancestor of musicians and musical culture.",
    "scripture": "Gen 4:21",
    "descendants": []
  },
  "tubalcain": {
    "name": "Tubal-Cain",
    "bio": "Son of Lamech and Zillah. He was an instructor of every craftsman in bronze and iron, becoming the ancestor of metalworking and tool-making.",
    "scripture": "Gen 4:22",
    "descendants": []
  },
  "naamah": {
    "name": "Naamah",
    "bio": "Daughter of Lamech and Zillah, sister of Tubal-Cain. One of the few women mentioned in the early genealogies before the flood.",
    "scripture": "Gen 4:22",
    "descendants": []
  },
  "seth": {
    "name": "Seth",
    "bio": "Third named son of Adam and Eve, born after Abel's murder. His name means 'appointed' or 'granted,' as Eve said God appointed him in place of Abel. Through Seth came the godly line that called upon the name of the LORD, leading ultimately to Noah and Christ.",
    "scripture": "Gen 4:25-26; 5:3-8; Luke 3:38",
    "descendants": [
      "enosh"
    ]
  },
  "enosh": {
    "name": "Enosh",
    "bio": "Son of Seth and grandson of Adam. During his lifetime, people began to call upon the name of the LORD. His name means 'mortal' or 'frail man,' reflecting human mortality after the Fall.",
    "scripture": "Gen 4:26; 5:6-11; 1 Chr 1:1; Luke 3:38",
    "descendants": [
      "kenan"
    ]
  },
  "kenan": {
    "name": "Kenan",
    "bio": "Son of Enosh in the Genesis 5 genealogy. He lived 910 years, part of the long-lived antediluvian patriarchs. Little else is recorded about his life.",
    "scripture": "Gen 5:9-14; 1 Chr 1:2; Luke 3:37",
    "descendants": [
      "mahalalel"
    ]
  },
  "mahalalel": {
    "name": "Mahalalel",
    "bio": "Son of Kenan and father of Jared. He lived 895 years. His name means 'praise of God' or 'God is splendor,' continuing the godly line from Adam to Noah.",
    "scripture": "Gen 5:12-17; 1 Chr 1:2; Luke 3:37",
    "descendants": [
      "jared"
    ]
  },
  "jared": {
    "name": "Jared",
    "bio": "Son of Mahalalel and father of Enoch. He lived 962 years, making him the second-longest lived person recorded in Scripture after his grandson Methuselah. His name means 'descent.'",
    "scripture": "Gen 5:15-20; 1 Chr 1:2; Luke 3:37",
    "descendants": [
      "enoch"
    ]
  },
  "enoch": {
    "name": "Enoch",
    "bio": "Son of Jared, father of Methuselah. He walked faithfully with God for 300 years after Methuselah's birth. At age 365, God took him directly to heaven without experiencing death. He prophesied about the Lord's coming with thousands of holy ones. Enoch stands as an example of faith and fellowship with God.",
    "scripture": "Gen 5:18-24; 1 Chr 1:3; Luke 3:37; Heb 11:5; Jude 1:14-15",
    "descendants": [
      "methuselah"
    ]
  },
  "methuselah": {
    "name": "Methuselah",
    "bio": "Son of Enoch and father of Lamech. He holds the record for the longest lifespan in Scripture at 969 years. His name may mean 'when he dies, it shall come,' and notably, he died the same year as the flood. He represents God's patience in delaying judgment.",
    "scripture": "Gen 5:21-27; 1 Chr 1:3; Luke 3:37",
    "descendants": [
      "lamech"
    ]
  },
  "lamech": {
    "name": "Lamech (Seth's line)",
    "bio": "Son of Methuselah and father of Noah. He lived 777 years. When Noah was born, Lamech prophesied that his son would bring comfort from the curse God placed on the ground. This Lamech is distinct from the violent Lamech in Cain's line.",
    "scripture": "Gen 5:25-31; 1 Chr 1:3; Luke 3:36",
    "descendants": [
      "noah"
    ]
  },
  "noah": {
    "name": "Noah",
    "bio": "Son of Lamech, father of Shem, Ham, and Japheth. A righteous man who walked with God in a corrupt generation. God instructed him to build an ark to save his family and representatives of all animals from the worldwide flood. After the flood, God made a covenant with Noah (rainbow covenant) promising never to destroy the earth by flood again. He lived 950 years.",
    "scripture": "Gen 5:28-10:32; 1 Chr 1:4; Isa 54:9; Ezek 14:14, 20; Matt 24:37-38; Luke 3:36; 17:26-27; Heb 11:7; 1 Pet 3:20; 2 Pet 2:5",
    "descendants": [
      "shem",
      "ham",
      "japheth"
    ]
  },
  "shem": {
    "name": "Shem",
    "bio": "Eldest named son of Noah, father of the Semitic peoples. Along with Japheth, he respectfully covered his father's nakedness and received Noah's blessing. The covenant line continues through him to Abraham and ultimately Christ. He lived 600 years.",
    "scripture": "Gen 5:32; 6:10; 7:13; 9:18-27; 10:1, 21-31; 11:10-11; 1 Chr 1:4, 17-24; Luke 3:36",
    "descendants": [
      "elam",
      "asshur",
      "arpachshad",
      "lud",
      "aram"
    ]
  },
  "elam": {
    "name": "Elam",
    "bio": "First listed son of Shem, ancestor of the Elamites who inhabited the Persian region. Elam became a significant ancient kingdom east of Mesopotamia.",
    "scripture": "Gen 10:22; 1 Chr 1:17",
    "descendants": []
  },
  "asshur": {
    "name": "Asshur",
    "bio": "Son of Shem, ancestor and likely founder of the Assyrians. Assyria became a major empire that eventually conquered the northern kingdom of Israel.",
    "scripture": "Gen 10:22; 1 Chr 1:17",
    "descendants": []
  },
  "lud": {
    "name": "Lud",
    "bio": "Son of Shem, ancestor of the Lydians who settled in western Asia Minor (modern-day Turkey). The Lydians were known for commerce and warfare.",
    "scripture": "Gen 10:22; 1 Chr 1:17",
    "descendants": []
  },
  "aram": {
    "name": "Aram",
    "bio": "Son of Shem, ancestor of the Arameans (Syrians). The Aramaic language became the lingua franca of the ancient Near East. Damascus was the capital of Aram. The Arameans had frequent interactions, both peaceful and hostile, with Israel.",
    "scripture": "Gen 10:22-23; 1 Chr 1:17",
    "descendants": [
      "uz",
      "hul",
      "gether",
      "mash"
    ]
  },
  "uz": {
    "name": "Uz",
    "bio": "Son of Aram, gave his name to the land of Uz where Job lived. The location of Uz is debated but was likely in northern Arabia or Edom.",
    "scripture": "Gen 10:23; 1 Chr 1:17, 42; Job 1:1",
    "descendants": []
  },
  "hul": {
    "name": "Hul",
    "bio": "Son of Aram in the Table of Nations. Little else is known about his descendants.",
    "scripture": "Gen 10:23; 1 Chr 1:17",
    "descendants": []
  },
  "gether": {
    "name": "Gether",
    "bio": "Son of Aram listed in the Table of Nations. His descendants are not clearly identified in Scripture.",
    "scripture": "Gen 10:23",
    "descendants": []
  },
  "mash": {
    "name": "Mash",
    "bio": "Son of Aram (also called Meshech in 1 Chronicles). Part of the Aramean peoples descended from Shem.",
    "scripture": "Gen 10:23; 1 Chr 1:17",
    "descendants": []
  },
  "ham": {
    "name": "Ham",
    "bio": "Son of Noah, father of Cush, Mizraim, Put, and Canaan. He saw his father's nakedness and did not cover him respectfully, leading Noah to curse Ham's son Canaan. Through Ham came many peoples including Egyptians, Cushites, and Canaanites.",
    "scripture": "Gen 5:32; 6:10; 7:13; 9:18-27; 10:1, 6-20; 1 Chr 1:4, 8-16; Ps 78:51; 105:23, 27; 106:22",
    "descendants": [
      "cush",
      "mizraim",
      "put",
      "canaan"
    ]
  },
  "cush": {
    "name": "Cush",
    "bio": "Son of Ham, father of Nimrod. Ancestor of the Cushites who inhabited the region of Ethiopia/Nubia in Africa. His name became synonymous with the land of Cush (Ethiopia).",
    "scripture": "Gen 10:6-8; 1 Chr 1:8-10; Isa 11:11; Jer 46:9",
    "descendants": [
      "seba",
      "havilah_cush",
      "sabtah",
      "raamah",
      "sabteca",
      "nimrod"
    ]
  },
  "seba": {
    "name": "Seba",
    "bio": "Son of Cush, associated with a region in southern Arabia or northeast Africa. Possibly connected to the Sabaeans.",
    "scripture": "Gen 10:7; 1 Chr 1:9",
    "descendants": []
  },
  "havilah_cush": {
    "name": "Havilah (Cush's line)",
    "bio": "Son of Cush, gave his name to a region rich in gold mentioned in Genesis 2. Different from Havilah descended from Joktan.",
    "scripture": "Gen 10:7; 1 Chr 1:9",
    "descendants": []
  },
  "sabtah": {
    "name": "Sabtah",
    "bio": "Son of Cush listed in the Table of Nations. His descendants likely settled in southern Arabia.",
    "scripture": "Gen 10:7; 1 Chr 1:9",
    "descendants": []
  },
  "raamah": {
    "name": "Raamah",
    "bio": "Son of Cush and father of Sheba and Dedan. Associated with a trading people in southern Arabia.",
    "scripture": "Gen 10:7; 1 Chr 1:9; Ezek 27:22",
    "descendants": [
      "sheba_raamah",
      "dedan_raamah"
    ]
  },
  "sheba_raamah": {
    "name": "Sheba (Raamah's line)",
    "bio": "Son of Raamah, grandson of Cush. Part of the Arabian trading peoples. Distinct from other Shebas in Scripture.",
    "scripture": "Gen 10:7; 1 Chr 1:9",
    "descendants": []
  },
  "dedan_raamah": {
    "name": "Dedan (Raamah's line)",
    "bio": "Son of Raamah, associated with trading peoples in northern Arabia. Distinct from Dedan descended from Abraham.",
    "scripture": "Gen 10:7; 1 Chr 1:9; Jer 49:8; Ezek 25:13; 27:20",
    "descendants": []
  },
  "sabteca": {
    "name": "Sabteca",
    "bio": "Son of Cush listed in the Table of Nations. His descendants likely inhabited regions in or near Ethiopia.",
    "scripture": "Gen 10:7; 1 Chr 1:9",
    "descendants": []
  },
  "nimrod": {
    "name": "Nimrod",
    "bio": "Son of Cush, described as a mighty warrior and hunter before the LORD. He founded several cities including Babel (Babylon), Erech, Accad, and Nineveh. Tradition associates him with building the Tower of Babel in rebellion against God. He established the first kingdom after the flood.",
    "scripture": "Gen 10:8-12; 1 Chr 1:10; Mic 5:6",
    "descendants": []
  },
  "mizraim": {
    "name": "Mizraim",
    "bio": "Son of Ham, ancestor and Hebrew name for Egypt. His descendants populated Egypt and surrounding regions including the Philistines.",
    "scripture": "Gen 10:6, 13-14; 1 Chr 1:8, 11-12",
    "descendants": [
      "ludim",
      "anamim",
      "lehabim",
      "naphtuhim",
      "pathrusim",
      "casluhim",
      "caphtorim"
    ]
  },
  "ludim": {
    "name": "Ludim",
    "bio": "Son of Mizraim, possibly ancestor of a North African people near Egypt.",
    "scripture": "Gen 10:13; 1 Chr 1:11",
    "descendants": []
  },
  "anamim": {
    "name": "Anamim",
    "bio": "Son of Mizraim, probably associated with a people group in the Nile Delta region.",
    "scripture": "Gen 10:13; 1 Chr 1:11",
    "descendants": []
  },
  "lehabim": {
    "name": "Lehabim",
    "bio": "Son of Mizraim, possibly connected to Libya or Libyan peoples.",
    "scripture": "Gen 10:13; 1 Chr 1:11",
    "descendants": []
  },
  "naphtuhim": {
    "name": "Naphtuhim",
    "bio": "Son of Mizraim, associated with a people group in central or lower Egypt.",
    "scripture": "Gen 10:13; 1 Chr 1:11",
    "descendants": []
  },
  "pathrusim": {
    "name": "Pathrusim",
    "bio": "Son of Mizraim, ancestor of people from Pathros (upper/southern Egypt). Pathros is mentioned in several prophetic passages.",
    "scripture": "Gen 10:14; 1 Chr 1:12; Isa 11:11; Jer 44:1, 15; Ezek 29:14; 30:14",
    "descendants": []
  },
  "casluhim": {
    "name": "Casluhim",
    "bio": "Son of Mizraim, from whom came the Philistines according to Genesis (though other passages also connect them to Caphtor/Crete).",
    "scripture": "Gen 10:14; 1 Chr 1:12",
    "descendants": []
  },
  "caphtorim": {
    "name": "Caphtorim",
    "bio": "Son of Mizraim, associated with Caphtor (likely Crete or Cyprus). Also connected to the origin of the Philistines.",
    "scripture": "Gen 10:14; 1 Chr 1:12; Deut 2:23; Jer 47:4; Amos 9:7",
    "descendants": []
  },
  "put": {
    "name": "Put",
    "bio": "Son of Ham, ancestor of peoples in Libya/North Africa. Put (Libya) is mentioned alongside other nations in prophetic and historical contexts.",
    "scripture": "Gen 10:6; 1 Chr 1:8; Jer 46:9; Ezek 27:10; 30:5; 38:5; Nah 3:9",
    "descendants": []
  },
  "canaan": {
    "name": "Canaan",
    "bio": "Fourth son of Ham, cursed by Noah because of Ham's disrespect. Ancestor of the Canaanite peoples who occupied the Promised Land before Israel. The curse led to their eventual displacement by Israel, though the moral justification was their great wickedness.",
    "scripture": "Gen 9:18-27; 10:6, 15-19; 1 Chr 1:8, 13-16",
    "descendants": [
      "sidon",
      "heth",
      "jebusite",
      "amorite",
      "girgashite",
      "hivite",
      "arkite",
      "sinite",
      "arvadite",
      "zemarite",
      "hamathite"
    ]
  },
  "sidon": {
    "name": "Sidon",
    "bio": "Firstborn of Canaan, ancestor and namesake of the Sidonians, a prominent Phoenician people. The city of Sidon became a major port and trading center.",
    "scripture": "Gen 10:15; 1 Chr 1:13; Isa 23:2, 4, 12; Ezek 28:21-22",
    "descendants": []
  },
  "heth": {
    "name": "Heth",
    "bio": "Son of Canaan, ancestor of the Hittites. The Hittites were prominent in Canaan; Abraham bought the cave of Machpelah from them. The great Hittite empire was centered in Anatolia.",
    "scripture": "Gen 10:15; 23:3-20; 1 Chr 1:13",
    "descendants": []
  },
  "jebusite": {
    "name": "Jebusite",
    "bio": "Son of Canaan, ancestor of the Jebusites who originally inhabited Jerusalem (called Jebus). David conquered the city from them, making it his capital.",
    "scripture": "Gen 10:16; 15:21; Josh 15:63; 2 Sam 5:6-9; 1 Chr 1:14",
    "descendants": []
  },
  "amorite": {
    "name": "Amorite",
    "bio": "Son of Canaan, ancestor of the Amorites, one of the most powerful and widespread Canaanite peoples. They occupied the hill country and are frequently mentioned as enemies of Israel.",
    "scripture": "Gen 10:16; 15:16; Num 13:29; Josh 10:5; 1 Chr 1:14",
    "descendants": []
  },
  "girgashite": {
    "name": "Girgashite",
    "bio": "Son of Canaan, ancestor of the Girgashites, one of the seven nations of Canaan. Less is known about them compared to other Canaanite peoples.",
    "scripture": "Gen 10:16; 15:21; Deut 7:1; Josh 3:10; 1 Chr 1:14",
    "descendants": []
  },
  "hivite": {
    "name": "Hivite",
    "bio": "Son of Canaan, ancestor of the Hivites, one of the Canaanite peoples. They lived in various regions including Shechem and Gibeon. The Gibeonites who deceived Joshua were Hivites.",
    "scripture": "Gen 10:17; 34:2; Josh 9:3-7; 1 Chr 1:15",
    "descendants": []
  },
  "arkite": {
    "name": "Arkite",
    "bio": "Son of Canaan, associated with the city of Arka in northern Phoenicia/Lebanon.",
    "scripture": "Gen 10:17; 1 Chr 1:15",
    "descendants": []
  },
  "sinite": {
    "name": "Sinite",
    "bio": "Son of Canaan, possibly connected to a fortress city in Lebanon or northern Canaan.",
    "scripture": "Gen 10:17; 1 Chr 1:15",
    "descendants": []
  },
  "arvadite": {
    "name": "Arvadite",
    "bio": "Son of Canaan, ancestor of inhabitants of Arvad, an island city off the coast of Phoenicia. Arvadites were known as skilled mariners.",
    "scripture": "Gen 10:18; 1 Chr 1:16; Ezek 27:8, 11",
    "descendants": []
  },
  "zemarite": {
    "name": "Zemarite",
    "bio": "Son of Canaan, associated with a city in Phoenicia, possibly near modern Syria/Lebanon.",
    "scripture": "Gen 10:18; 1 Chr 1:16",
    "descendants": []
  },
  "hamathite": {
    "name": "Hamathite",
    "bio": "Son of Canaan, ancestor of inhabitants of Hamath, a significant city in Syria. Hamath marked Israel's northern boundary.",
    "scripture": "Gen 10:18; 1 Chr 1:16; Num 13:21; 2 Sam 8:9",
    "descendants": []
  },
  "japheth": {
    "name": "Japheth",
    "bio": "Son of Noah, father of the Indo-European nations. With Shem, he respectfully covered their father Noah's nakedness and received a blessing. Noah prophesied that Japheth would 'dwell in the tents of Shem,' indicating future blessing through Shem's line.",
    "scripture": "Gen 5:32; 6:10; 7:13; 9:18-27; 10:1-5; 1 Chr 1:4-7",
    "descendants": [
      "gomer",
      "magog",
      "madai",
      "javan",
      "tubal",
      "meshech",
      "tiras"
    ]
  },
  "gomer": {
    "name": "Gomer",
    "bio": "Son of Japheth, ancestor of the Cimmerians who settled in Asia Minor and the Black Sea region. The name is associated with ancient peoples north of Israel.",
    "scripture": "Gen 10:2-3; 1 Chr 1:5-6; Ezek 38:6",
    "descendants": [
      "ashkenaz",
      "riphath",
      "togarmah"
    ]
  },
  "ashkenaz": {
    "name": "Ashkenaz",
    "bio": "Son of Gomer, associated with a kingdom near Ararat. Later Jewish tradition connected this name with Germany, leading to the term 'Ashkenazi Jews.'",
    "scripture": "Gen 10:3; 1 Chr 1:6; Jer 51:27",
    "descendants": []
  },
  "riphath": {
    "name": "Riphath",
    "bio": "Son of Gomer. The exact location of his descendants is uncertain, possibly in Asia Minor or near the Black Sea.",
    "scripture": "Gen 10:3; 1 Chr 1:6",
    "descendants": []
  },
  "togarmah": {
    "name": "Togarmah",
    "bio": "Son of Gomer, associated with a region in eastern Anatolia (Turkey). Known for horses and mules in trade.",
    "scripture": "Gen 10:3; 1 Chr 1:6; Ezek 27:14; 38:6",
    "descendants": []
  },
  "magog": {
    "name": "Magog",
    "bio": "Son of Japheth, ancestor of peoples in the far north. In Ezekiel's prophecy, Gog of the land of Magog is a future enemy of Israel.",
    "scripture": "Gen 10:2; 1 Chr 1:5; Ezek 38:2; 39:6; Rev 20:8",
    "descendants": []
  },
  "madai": {
    "name": "Madai",
    "bio": "Son of Japheth, ancestor of the Medes who inhabited Media (northwestern Iran). The Medes partnered with Persians to conquer Babylon.",
    "scripture": "Gen 10:2; 1 Chr 1:5",
    "descendants": []
  },
  "javan": {
    "name": "Javan",
    "bio": "Son of Japheth, ancestor of the Greeks/Ionians. His name is the Hebrew word for Greece. His descendants populated the coastlands and islands of the Mediterranean.",
    "scripture": "Gen 10:2, 4-5; 1 Chr 1:5, 7; Isa 66:19; Ezek 27:13; Dan 8:21; 10:20; 11:2; Joel 3:6; Zech 9:13",
    "descendants": [
      "elishah",
      "tarshish",
      "kittim",
      "dodanim"
    ]
  },
  "elishah": {
    "name": "Elishah",
    "bio": "Son of Javan, associated with Cyprus or Greek islands/coastlands. Known for producing purple dye.",
    "scripture": "Gen 10:4; 1 Chr 1:7; Ezek 27:7",
    "descendants": []
  },
  "tarshish": {
    "name": "Tarshish",
    "bio": "Son of Javan, gave his name to a distant maritime city/region, possibly in Spain. Tarshish was known for trade in metals. Jonah tried to flee there to escape God's call.",
    "scripture": "Gen 10:4; 1 Chr 1:7; 1 Kgs 10:22; Ps 72:10; Isa 23:1; Jonah 1:3",
    "descendants": []
  },
  "kittim": {
    "name": "Kittim",
    "bio": "Son of Javan, associated with Cyprus (ancient Kition). The name came to represent western peoples and islands in general.",
    "scripture": "Gen 10:4; Num 24:24; 1 Chr 1:7; Isa 23:1, 12; Jer 2:10; Ezek 27:6; Dan 11:30",
    "descendants": []
  },
  "dodanim": {
    "name": "Dodanim",
    "bio": "Son of Javan, possibly connected to Rhodes or other Greek islands (also called Rodanim in some texts).",
    "scripture": "Gen 10:4; 1 Chr 1:7",
    "descendants": []
  },
  "tubal": {
    "name": "Tubal",
    "bio": "Son of Japheth, associated with a people in eastern Asia Minor. Mentioned with Meshech as trading partners and warriors.",
    "scripture": "Gen 10:2; 1 Chr 1:5; Isa 66:19; Ezek 27:13; 32:26; 38:2-3; 39:1",
    "descendants": []
  },
  "meshech": {
    "name": "Meshech",
    "bio": "Son of Japheth, associated with a people in Asia Minor/Caucasus region. Frequently paired with Tubal in prophetic literature as distant northern peoples.",
    "scripture": "Gen 10:2; 1 Chr 1:5; Ps 120:5; Ezek 27:13; 32:26; 38:2-3; 39:1",
    "descendants": []
  },
  "tiras": {
    "name": "Tiras",
    "bio": "Son of Japheth, possibly ancestor of Thracians or other peoples in the region north of Greece and Asia Minor.",
    "scripture": "Gen 10:2; 1 Chr 1:5",
    "descendants": []
  },
  "arpachshad": {
    "name": "Arpachshad",
    "bio": "Son of Shem, born two years after the flood. Through him came the line leading to Abraham and ultimately Christ. He lived 438 years. The exact location of his descendants is debated, possibly in northern Mesopotamia.",
    "scripture": "Gen 10:22, 24; 11:10-13; 1 Chr 1:17-18, 24; Luke 3:36",
    "descendants": [
      "shelah"
    ]
  },
  "shelah": {
    "name": "Shelah",
    "bio": "Son of Arpachshad (or grandson, as Luke mentions Cainan between them), father of Eber. He lived 433 years. Part of the post-flood patriarchal line to Abraham.",
    "scripture": "Gen 10:24; 11:12-15; 1 Chr 1:18, 24; Luke 3:35",
    "descendants": [
      "eber"
    ]
  },
  "eber": {
    "name": "Eber",
    "bio": "Son of Shelah, father of Peleg and Joktan. His name is the origin of the term 'Hebrew' (Ibri). He lived 464 years, bridging the generations from the early post-flood period to Abraham's time. His descendants included both the Hebrews (through Peleg) and many Arabian tribes (through Joktan).",
    "scripture": "Gen 10:21, 24-25; 11:14-17; Num 24:24; 1 Chr 1:18-19, 25; Luke 3:35",
    "descendants": [
      "peleg",
      "joktan"
    ]
  },
  "joktan": {
    "name": "Joktan",
    "bio": "Son of Eber, brother of Peleg. Ancestor of thirteen Arabian tribes who settled in southern Arabia. While his brother's line led to Abraham, Joktan's descendants populated the Arabian Peninsula.",
    "scripture": "Gen 10:25-29; 1 Chr 1:19-23",
    "descendants": [
      "almodad",
      "sheleph",
      "hazarmaveth",
      "jerah",
      "hadoram",
      "uzal",
      "diklah",
      "obal",
      "abimael",
      "sheba_joktan",
      "ophir",
      "havilah_joktan",
      "jobab"
    ]
  },
  "almodad": {
    "name": "Almodad",
    "bio": "Firstborn son of Joktan, ancestor of an Arabian tribe. The exact location of his descendants is uncertain, likely in southern Arabia.",
    "scripture": "Gen 10:26; 1 Chr 1:20",
    "descendants": []
  },
  "sheleph": {
    "name": "Sheleph",
    "bio": "Son of Joktan, associated with an Arabian tribe, possibly in Yemen or southern Arabia.",
    "scripture": "Gen 10:26; 1 Chr 1:20",
    "descendants": []
  },
  "hazarmaveth": {
    "name": "Hazarmaveth",
    "bio": "Son of Joktan, his name means 'court of death.' Associated with Hadramaut in southern Arabia (modern Yemen).",
    "scripture": "Gen 10:26; 1 Chr 1:20",
    "descendants": []
  },
  "jerah": {
    "name": "Jerah",
    "bio": "Son of Joktan, his name means 'moon.' Possibly associated with a tribe in Arabia that practiced lunar worship.",
    "scripture": "Gen 10:26; 1 Chr 1:20",
    "descendants": []
  },
  "hadoram": {
    "name": "Hadoram",
    "bio": "Son of Joktan, associated with an Arabian tribe, possibly in southern or eastern Arabia.",
    "scripture": "Gen 10:27; 1 Chr 1:21",
    "descendants": []
  },
  "uzal": {
    "name": "Uzal",
    "bio": "Son of Joktan, associated with Sana'a, the capital of modern Yemen. Known as a trading center.",
    "scripture": "Gen 10:27; 1 Chr 1:21; Ezek 27:19",
    "descendants": []
  },
  "diklah": {
    "name": "Diklah",
    "bio": "Son of Joktan, his name possibly means 'palm tree.' Associated with an oasis region in Arabia.",
    "scripture": "Gen 10:27; 1 Chr 1:21",
    "descendants": []
  },
  "obal": {
    "name": "Obal",
    "bio": "Son of Joktan (called Ebal in 1 Chronicles), associated with a tribe in southern Arabia.",
    "scripture": "Gen 10:28; 1 Chr 1:22",
    "descendants": []
  },
  "abimael": {
    "name": "Abimael",
    "bio": "Son of Joktan, his name means 'my father is God.' Associated with an Arabian tribe.",
    "scripture": "Gen 10:28; 1 Chr 1:22",
    "descendants": []
  },
  "sheba_joktan": {
    "name": "Sheba (Joktan's line)",
    "bio": "Son of Joktan, associated with the Sabaeans of southern Arabia (Yemen). Famous for the Queen of Sheba who visited Solomon. Distinct from other Shebas in Scripture.",
    "scripture": "Gen 10:28; 1 Chr 1:22; 1 Kgs 10:1-13",
    "descendants": []
  },
  "ophir": {
    "name": "Ophir",
    "bio": "Son of Joktan, gave his name to a region famous for gold. Solomon's ships brought gold from Ophir. The exact location is debated (Arabia, East Africa, or India).",
    "scripture": "Gen 10:29; 1 Chr 1:23; 1 Kgs 9:28; 10:11; Job 22:24; 28:16; Ps 45:9; Isa 13:12",
    "descendants": []
  },
  "havilah_joktan": {
    "name": "Havilah (Joktan's line)",
    "bio": "Son of Joktan, associated with a region in Arabia. Distinct from Havilah son of Cush. The Ishmaelites lived 'from Havilah to Shur.'",
    "scripture": "Gen 10:29; 1 Chr 1:23; Gen 25:18",
    "descendants": []
  },
  "jobab": {
    "name": "Jobab",
    "bio": "Son of Joktan, last listed of his thirteen sons. Some traditions have speculated this might be Job, though this is uncertain.",
    "scripture": "Gen 10:29; 1 Chr 1:23",
    "descendants": []
  },
  "peleg": {
    "name": "Peleg",
    "bio": "Son of Eber, father of Reu. His name means 'division,' because 'in his days the earth was divided'—likely referring to the dispersion at Babel. He lived 239 years. The messianic line continues through him to Abraham.",
    "scripture": "Gen 10:25; 11:16-19; 1 Chr 1:19, 25; Luke 3:35",
    "descendants": [
      "reu"
    ]
  },
  "reu": {
    "name": "Reu",
    "bio": "Son of Peleg, father of Serug. He lived 239 years. Part of the genealogical line from Noah to Abraham, connecting the early post-flood period to the patriarchs.",
    "scripture": "Gen 11:18-21; 1 Chr 1:25; Luke 3:35",
    "descendants": [
      "serug"
    ]
  },
  "serug": {
    "name": "Serug",
    "bio": "Son of Reu, father of Nahor. He lived 230 years. Part of the transitional generations between Noah and Abraham, living during the rise of early civilizations in Mesopotamia.",
    "scripture": "Gen 11:20-23; 1 Chr 1:26; Luke 3:35",
    "descendants": [
      "nahor"
    ]
  },
  "nahor": {
    "name": "Nahor (Terah's father)",
    "bio": "Son of Serug, father of Terah, grandfather of Abraham. He lived 148 years. The city of Nahor in Mesopotamia may have been named after him or his grandson.",
    "scripture": "Gen 11:22-25; 1 Chr 1:26; Luke 3:34",
    "descendants": [
      "terah"
    ]
  },
  "terah": {
    "name": "Terah",
    "bio": "Son of Nahor, father of Abraham, Nahor, and Haran. He lived in Ur of the Chaldeans and moved his family to Haran in obedience to God's call to Abraham. He died in Haran at age 205. Joshua records that Terah served other gods beyond the Euphrates before God called Abraham.",
    "scripture": "Gen 11:24-32; Josh 24:2; 1 Chr 1:26; Luke 3:34",
    "descendants": [
      "abraham",
      "nahor2",
      "haran"
    ]
  },
  "abraham": {
    "name": "Abraham (Abram)",
    "bio": "Son of Terah, father of Isaac, Ishmael, and six sons by Keturah. Called by God to leave Ur and go to Canaan. God made a covenant with him promising descendants as numerous as the stars, the land of Canaan, and that all nations would be blessed through him (fulfilled in Christ). Called the 'father of faith' for believing God's promise of a son in old age. Offered Isaac on Mount Moriah in the ultimate test of faith. Lived 175 years. Friend of God.",
    "scripture": "Gen 11:26-25:11; Ex 2:24; Matt 1:1-2; Luke 3:34; John 8:39-58; Rom 4:1-25; Gal 3:6-29; Heb 11:8-19; James 2:21-23",
    "descendants": [
      "isaac",
      "ishmael",
      "zimran",
      "jokshan",
      "medan",
      "midian",
      "ishbak",
      "shuah"
    ]
  },
  "nahor2": {
    "name": "Nahor (Abraham's brother)",
    "bio": "Son of Terah, brother of Abraham and Haran. Married his niece Milcah (Haran's daughter). Father of twelve sons including Bethuel (father of Rebekah). Remained in Mesopotamia when Abraham departed for Canaan. The city of Nahor was associated with his descendants.",
    "scripture": "Gen 11:26-29; 22:20-24; 24:10, 15, 24, 47; 29:5",
    "descendants": [
      "uz_nahor",
      "buz",
      "kemuel",
      "chesed",
      "hazo",
      "pildash",
      "jidlaph",
      "bethuel"
    ]
  },
  "uz_nahor": {
    "name": "Uz (Nahor's line)",
    "bio": "Firstborn son of Nahor and Milcah. Possibly connected to the land of Uz where Job lived, though the connection is uncertain.",
    "scripture": "Gen 22:21",
    "descendants": []
  },
  "buz": {
    "name": "Buz",
    "bio": "Second son of Nahor and Milcah. Ancestor of Elihu the Buzite, who spoke to Job. His descendants formed a tribe in northern Arabia.",
    "scripture": "Gen 22:21; Job 32:2, 6; Jer 25:23",
    "descendants": []
  },
  "kemuel": {
    "name": "Kemuel",
    "bio": "Third son of Nahor and Milcah, father of Aram. Part of the Aramean genealogy.",
    "scripture": "Gen 22:21",
    "descendants": [
      "aram_kemuel"
    ]
  },
  "aram_kemuel": {
    "name": "Aram (Kemuel's son)",
    "bio": "Son of Kemuel, grandson of Nahor. Distinct from other Arams in Scripture.",
    "scripture": "Gen 22:21",
    "descendants": []
  },
  "chesed": {
    "name": "Chesed",
    "bio": "Fourth son of Nahor and Milcah. Possibly connected to the Chaldeans (Kasdim), though this is debated.",
    "scripture": "Gen 22:22",
    "descendants": []
  },
  "hazo": {
    "name": "Hazo",
    "bio": "Fifth son of Nahor and Milcah. His descendants are not clearly identified.",
    "scripture": "Gen 22:22",
    "descendants": []
  },
  "pildash": {
    "name": "Pildash",
    "bio": "Sixth son of Nahor and Milcah. Little is known about his descendants.",
    "scripture": "Gen 22:22",
    "descendants": []
  },
  "jidlaph": {
    "name": "Jidlaph",
    "bio": "Seventh son of Nahor and Milcah. His descendants are not identified in Scripture.",
    "scripture": "Gen 22:22",
    "descendants": []
  },
  "bethuel": {
    "name": "Bethuel",
    "bio": "Eighth son of Nahor and Milcah, father of Rebekah and Laban. He lived in Mesopotamia. His role in Rebekah's betrothal to Isaac is minimal, with Laban seeming to take the lead.",
    "scripture": "Gen 22:22-23; 24:15, 24, 47, 50; 25:20; 28:2, 5",
    "descendants": [
      "rebekah",
      "laban"
    ]
  },
  "rebekah": {
    "name": "Rebekah",
    "bio": "Daughter of Bethuel, sister of Laban, wife of Isaac, mother of Jacob and Esau. Chosen by divine guidance to be Isaac's wife. She received a prophecy that two nations were in her womb and the older would serve the younger. She helped Jacob deceive Isaac to receive Esau's blessing. Known for her beauty, kindness, and decisiveness.",
    "scripture": "Gen 22:23; 24:1-67; 25:20-28; 26:6-11; 27:1-46; 28:5; 29:12; 35:8; 49:31; Rom 9:10-13",
    "descendants": []
  },
  "laban": {
    "name": "Laban",
    "bio": "Son of Bethuel, brother of Rebekah, father of Leah and Rachel. He lived in Haran (Mesopotamia). Known for deceiving Jacob by substituting Leah for Rachel on the wedding night, and for changing Jacob's wages ten times. Despite his deceptive nature, God used him in Jacob's life and through him came the mothers of the twelve tribes.",
    "scripture": "Gen 24:29-61; 27:43; 28:2-5; 29:1-30:43; 31:1-55; 32:4; 46:18, 25",
    "descendants": [
      "leah",
      "rachel"
    ]
  },
  "haran": {
    "name": "Haran",
    "bio": "Son of Terah, brother of Abraham and Nahor. Father of Lot, Milcah, and Iscah. He died in Ur of the Chaldeans before his father Terah, making him the first person recorded to die before his father.",
    "scripture": "Gen 11:26-29, 31",
    "descendants": [
      "lot",
      "milcah",
      "iscah"
    ]
  },
  "lot": {
    "name": "Lot",
    "bio": "Son of Haran, nephew of Abraham. He traveled with Abraham to Canaan but separated to live in Sodom. Angels rescued him from Sodom's destruction, though his wife looked back and became a pillar of salt. His daughters got him drunk and became pregnant by him, producing Moab and Ammon. Peter calls him a 'righteous man' tormented by the wickedness around him.",
    "scripture": "Gen 11:27, 31; 12:4-5; 13:1-14:16; 19:1-38; Deut 2:9, 19; Ps 83:8; Luke 17:28-32; 2 Pet 2:7-8",
    "descendants": [
      "moab",
      "benammi"
    ]
  },
  "moab": {
    "name": "Moab",
    "bio": "Son of Lot by his older daughter through incest after Sodom's destruction. Ancestor of the Moabites who settled east of the Dead Sea. The Moabites were often enemies of Israel, though Ruth was a Moabitess who became David's great-grandmother.",
    "scripture": "Gen 19:30-37; Num 21-25; Deut 2:9; Ruth 1:1-4:22; 2 Kgs 3:4-27",
    "descendants": []
  },
  "benammi": {
    "name": "Ben-Ammi",
    "bio": "Son of Lot by his younger daughter through incest. His name means 'son of my people.' Ancestor of the Ammonites who settled east of the Jordan. The Ammonites were frequently hostile to Israel.",
    "scripture": "Gen 19:30-38; Deut 2:19; Judg 10:6-11:33; 1 Sam 11:1-11; 2 Sam 10:1-19",
    "descendants": []
  },
  "milcah": {
    "name": "Milcah",
    "bio": "Daughter of Haran, sister of Lot. Married her uncle Nahor (Abraham's brother). Mother of eight sons including Bethuel (Rebekah's father). She remained in Mesopotamia.",
    "scripture": "Gen 11:29; 22:20-23; 24:15, 24, 47",
    "descendants": []
  },
  "iscah": {
    "name": "Iscah",
    "bio": "Daughter of Haran, sister of Lot and Milcah. One of the few women mentioned in the early genealogies, though nothing else is recorded about her.",
    "scripture": "Gen 11:29",
    "descendants": []
  },
  "ishmael": {
    "name": "Ishmael",
    "bio": "Son of Abraham and Hagar (Sarah's Egyptian maidservant). Born when Abraham was 86. God promised to make him a great nation and that he would be 'a wild donkey of a man.' He was circumcised at age 13. After Isaac's birth, Sarah had him and Hagar sent away, but God preserved them. He became an archer in the desert and had twelve sons who became tribal princes. He attended Abraham's burial. Lived 137 years. Ancestor of Arab peoples.",
    "scripture": "Gen 16:1-16; 17:18-27; 21:9-21; 25:9-18; 28:9; 36:3; 1 Chr 1:28-31; Gal 4:21-31",
    "descendants": [
      "nebaioth",
      "kedar",
      "adbeel",
      "mibsam",
      "mishma",
      "dumah",
      "massa",
      "hadad_ishmael",
      "tema",
      "jetur",
      "naphish",
      "kedemah"
    ]
  },
  "nebaioth": {
    "name": "Nebaioth",
    "bio": "Firstborn son of Ishmael, brother of Mahalath who married Esau. His descendants became a tribe in northern Arabia, possibly connected to the Nabateans.",
    "scripture": "Gen 25:13; 28:9; 36:3; 1 Chr 1:29; Isa 60:7",
    "descendants": []
  },
  "kedar": {
    "name": "Kedar",
    "bio": "Second son of Ishmael. His descendants became a prominent Arabian tribe known for their black tents, skilled archers, and flocks. Mentioned frequently in prophetic literature as representing Arabian peoples.",
    "scripture": "Gen 25:13; 1 Chr 1:29; Ps 120:5; Song 1:5; Isa 21:16-17; 42:11; 60:7; Jer 2:10; 49:28; Ezek 27:21",
    "descendants": []
  },
  "adbeel": {
    "name": "Adbeel",
    "bio": "Third son of Ishmael. His descendants formed a tribe in northern Arabia.",
    "scripture": "Gen 25:13; 1 Chr 1:29",
    "descendants": []
  },
  "mibsam": {
    "name": "Mibsam",
    "bio": "Fourth son of Ishmael. His descendants settled in Arabia.",
    "scripture": "Gen 25:13; 1 Chr 1:29",
    "descendants": []
  },
  "mishma": {
    "name": "Mishma",
    "bio": "Fifth son of Ishmael. His tribal descendants are mentioned in Arabian genealogies.",
    "scripture": "Gen 25:14; 1 Chr 1:30",
    "descendants": []
  },
  "dumah": {
    "name": "Dumah",
    "bio": "Sixth son of Ishmael. Associated with Dumat al-Jandal, an oasis in northern Arabia. Isaiah prophesied concerning Dumah.",
    "scripture": "Gen 25:14; 1 Chr 1:30; Isa 21:11",
    "descendants": []
  },
  "massa": {
    "name": "Massa",
    "bio": "Seventh son of Ishmael. His descendants formed a tribe in northern Arabia. Some speculate a connection to the wise sayings 'of Massa' in Proverbs 31.",
    "scripture": "Gen 25:14; 1 Chr 1:30; Prov 30:1; 31:1",
    "descendants": []
  },
  "hadad_ishmael": {
    "name": "Hadad (Ishmael's line)",
    "bio": "Eighth son of Ishmael. His descendants settled in Arabia. Distinct from other Hadads in Scripture.",
    "scripture": "Gen 25:15; 1 Chr 1:30",
    "descendants": []
  },
  "tema": {
    "name": "Tema",
    "bio": "Ninth son of Ishmael. His descendants inhabited Tema, an important oasis in northwest Arabia on caravan routes. Mentioned in Job and prophetic literature.",
    "scripture": "Gen 25:15; 1 Chr 1:30; Job 6:19; Isa 21:14; Jer 25:23",
    "descendants": []
  },
  "jetur": {
    "name": "Jetur",
    "bio": "Tenth son of Ishmael. His descendants (Jaturites/Itureans) settled in the region east of the Jordan and were later conquered by the tribe of Reuben.",
    "scripture": "Gen 25:15; 1 Chr 1:31; 5:19",
    "descendants": []
  },
  "naphish": {
    "name": "Naphish",
    "bio": "Eleventh son of Ishmael. His descendants were defeated by the tribes of Reuben, Gad, and Manasseh.",
    "scripture": "Gen 25:15; 1 Chr 1:31; 5:19",
    "descendants": []
  },
  "kedemah": {
    "name": "Kedemah",
    "bio": "Twelfth son of Ishmael. His name means 'eastward' or 'toward the east,' fitting for the Ishmaelite settlement pattern. His descendants became one of the twelve Arabian tribal princes.",
    "scripture": "Gen 25:15; 1 Chr 1:31",
    "descendants": []
  },
  "zimran": {
    "name": "Zimran",
    "bio": "First son of Abraham by Keturah (taken after Sarah's death). His descendants may have settled in Arabia.",
    "scripture": "Gen 25:1-2; 1 Chr 1:32",
    "descendants": []
  },
  "jokshan": {
    "name": "Jokshan",
    "bio": "Second son of Abraham by Keturah, father of Sheba and Dedan. His descendants settled in Arabia and became trading peoples.",
    "scripture": "Gen 25:2-3; 1 Chr 1:32",
    "descendants": [
      "sheba_jokshan",
      "dedan_jokshan"
    ]
  },
  "sheba_jokshan": {
    "name": "Sheba (Jokshan's line)",
    "bio": "Son of Jokshan, grandson of Abraham and Keturah. Associated with Sabaean trading peoples. Distinct from other Shebas in Scripture.",
    "scripture": "Gen 25:3; 1 Chr 1:32",
    "descendants": []
  },
  "dedan_jokshan": {
    "name": "Dedan (Jokshan's line)",
    "bio": "Son of Jokshan, grandson of Abraham. His descendants (Asshurim, Letushim, Leummim) became Arabian peoples engaged in trade. Distinct from Dedan son of Raamah.",
    "scripture": "Gen 25:3; 1 Chr 1:32",
    "descendants": []
  },
  "medan": {
    "name": "Medan",
    "bio": "Third son of Abraham by Keturah. His descendants likely settled in northern Arabia.",
    "scripture": "Gen 25:2; 1 Chr 1:32",
    "descendants": []
  },
  "midian": {
    "name": "Midian",
    "bio": "Fourth son of Abraham by Keturah. Ancestor of the Midianites who became a significant people east and southeast of Canaan. Moses' father-in-law Jethro was a Midianite priest. The Midianites later oppressed Israel during the period of the Judges until Gideon defeated them.",
    "scripture": "Gen 25:1-4; 36:35; 37:28, 36; Ex 2:15-3:1; Num 22:4-25:18; 31:1-12; Judg 6-8; 1 Chr 1:32-33",
    "descendants": [
      "ephah",
      "epher",
      "hanoch_midian",
      "abida",
      "eldaah"
    ]
  },
  "ephah": {
    "name": "Ephah",
    "bio": "Son of Midian, grandson of Abraham. His descendants were known for their camels and are mentioned in prophetic passages about Arabian peoples bringing tribute.",
    "scripture": "Gen 25:4; 1 Chr 1:33; Isa 60:6",
    "descendants": []
  },
  "epher": {
    "name": "Epher",
    "bio": "Son of Midian, grandson of Abraham. His descendants settled in the Midianite region.",
    "scripture": "Gen 25:4; 1 Chr 1:33",
    "descendants": []
  },
  "hanoch_midian": {
    "name": "Hanoch (Midian's line)",
    "bio": "Son of Midian, grandson of Abraham. Distinct from other Hanochs in Scripture.",
    "scripture": "Gen 25:4; 1 Chr 1:33",
    "descendants": []
  },
  "abida": {
    "name": "Abida",
    "bio": "Son of Midian, his name means 'my father knows.' Part of the Midianite tribal structure.",
    "scripture": "Gen 25:4; 1 Chr 1:33",
    "descendants": []
  },
  "eldaah": {
    "name": "Eldaah",
    "bio": "Son of Midian, his name means 'God has known.' Last listed son of Midian in the Abrahamic genealogy.",
    "scripture": "Gen 25:4; 1 Chr 1:33",
    "descendants": []
  },
  "ishbak": {
    "name": "Ishbak",
    "bio": "Fifth son of Abraham by Keturah. His descendants are not clearly identified but likely settled in Arabia.",
    "scripture": "Gen 25:2; 1 Chr 1:32",
    "descendants": []
  },
  "shuah": {
    "name": "Shuah",
    "bio": "Sixth son of Abraham by Keturah. His descendants were the Shuhites. Bildad, one of Job's friends, was a Shuhite.",
    "scripture": "Gen 25:2; 1 Chr 1:32; Job 2:11; 8:1; 18:1; 25:1; 42:9",
    "descendants": []
  },
  "isaac": {
    "name": "Isaac",
    "bio": "Son of Abraham and Sarah, born miraculously when Abraham was 100 and Sarah 90. His name means 'he laughs.' Nearly sacrificed by Abraham on Mount Moriah in the ultimate test of faith, but God provided a ram. Married Rebekah, father of Jacob and Esau. Known for his peaceful nature, digging wells, and re-digging his father's wells. Blessed Jacob thinking he was Esau. Lived 180 years. The only patriarch who never left Canaan. Through him the covenant promise continued.",
    "scripture": "Gen 17:15-22:24; 24:1-28:9; 35:27-29; 46:1; 48:15-16; Ex 2:24; Matt 1:2; 8:11; Luke 3:34; Rom 9:7-10; Gal 4:28; Heb 11:17-20; James 2:21",
    "descendants": [
      "jacob",
      "esau"
    ]
  },
  "esau": {
    "name": "Esau (Edom)",
    "bio": "Firstborn son of Isaac and Rebekah, twin brother of Jacob. A skillful hunter and outdoorsman, he was Isaac's favorite. Sold his birthright to Jacob for a bowl of stew, showing contempt for it. Married Canaanite and Ishmaelite wives, grieving his parents. Lost his blessing to Jacob through deception. Initially sought to kill Jacob but later reconciled with him. Settled in Seir (Edom) and became ancestor of the Edomites, perpetual enemies of Israel.",
    "scripture": "Gen 25:19-34; 26:34-35; 27:1-28:9; 32:1-33:20; 36:1-43; Mal 1:2-3; Rom 9:13; Heb 12:16-17",
    "descendants": [
      "eliphaz_esau",
      "reuel",
      "jeush",
      "jalam",
      "korah_esau"
    ]
  },
  "eliphaz_esau": {
    "name": "Eliphaz (Esau's son)",
    "bio": "Firstborn son of Esau by Adah. Father of several Edomite chiefs including Teman. His concubine Timna bore Amalek, ancestor of Israel's perpetual enemy the Amalekites.",
    "scripture": "Gen 36:4, 10-12, 15-16; 1 Chr 1:35-36",
    "descendants": [
      "teman",
      "omar",
      "zepho",
      "gatam",
      "kenaz",
      "amalek"
    ]
  },
  "teman": {
    "name": "Teman",
    "bio": "Son of Eliphaz, grandson of Esau. Became an Edomite chief. His name became synonymous with a region in Edom known for wisdom. Eliphaz the Temanite, one of Job's friends, likely came from this line.",
    "scripture": "Gen 36:11, 15, 42; 1 Chr 1:36, 53; Job 2:11; Jer 49:7, 20; Ezek 25:13; Amos 1:12; Obad 1:9; Hab 3:3",
    "descendants": []
  },
  "omar": {
    "name": "Omar",
    "bio": "Son of Eliphaz, became an Edomite chief.",
    "scripture": "Gen 36:11, 15; 1 Chr 1:36",
    "descendants": []
  },
  "zepho": {
    "name": "Zepho",
    "bio": "Son of Eliphaz, became an Edomite chief (also called Zephi).",
    "scripture": "Gen 36:11, 15; 1 Chr 1:36",
    "descendants": []
  },
  "gatam": {
    "name": "Gatam",
    "bio": "Son of Eliphaz, became an Edomite chief.",
    "scripture": "Gen 36:11, 16; 1 Chr 1:36",
    "descendants": []
  },
  "kenaz": {
    "name": "Kenaz (Esau's line)",
    "bio": "Son of Eliphaz, became an Edomite chief. The Kenizzites were associated with Edom. Caleb's family later intermarried with this line.",
    "scripture": "Gen 36:11, 15, 42; 1 Chr 1:36, 53",
    "descendants": []
  },
  "amalek": {
    "name": "Amalek",
    "bio": "Son of Eliphaz by his concubine Timna, grandson of Esau. Ancestor of the Amalekites, Israel's perpetual enemy from the Exodus onward. They attacked Israel's weak and weary in the wilderness. God commanded their complete destruction. Saul's failure to completely destroy them led to his rejection as king.",
    "scripture": "Gen 36:12, 16; Ex 17:8-16; Num 24:20; Deut 25:17-19; 1 Sam 15:1-33; 1 Chr 1:36",
    "descendants": []
  },
  "reuel": {
    "name": "Reuel (Esau's son)",
    "bio": "Son of Esau by Basemath (Ishmael's daughter). Father of four sons who became Edomite chiefs. Distinct from Jethro/Reuel, Moses' father-in-law.",
    "scripture": "Gen 36:4, 10, 13, 17; 1 Chr 1:35, 37",
    "descendants": [
      "nahath",
      "zerah_reuel",
      "shammah",
      "mizzah"
    ]
  },
  "nahath": {
    "name": "Nahath",
    "bio": "Son of Reuel, became an Edomite chief.",
    "scripture": "Gen 36:13, 17; 1 Chr 1:37",
    "descendants": []
  },
  "zerah_reuel": {
    "name": "Zerah (Reuel's line)",
    "bio": "Son of Reuel, became an Edomite chief. Distinct from other Zerahs in Scripture.",
    "scripture": "Gen 36:13, 17; 1 Chr 1:37",
    "descendants": []
  },
  "shammah": {
    "name": "Shammah (Edom)",
    "bio": "Son of Reuel, became an Edomite chief.",
    "scripture": "Gen 36:13, 17; 1 Chr 1:37",
    "descendants": []
  },
  "mizzah": {
    "name": "Mizzah",
    "bio": "Son of Reuel, became an Edomite chief.",
    "scripture": "Gen 36:13, 17; 1 Chr 1:37",
    "descendants": []
  },
  "jeush": {
    "name": "Jeush (Esau's son)",
    "bio": "Son of Esau by Oholibamah, became an Edomite chief.",
    "scripture": "Gen 36:5, 14, 18; 1 Chr 1:35",
    "descendants": []
  },
  "jalam": {
    "name": "Jalam",
    "bio": "Son of Esau by Oholibamah, became an Edomite chief.",
    "scripture": "Gen 36:5, 14, 18; 1 Chr 1:35",
    "descendants": []
  },
  "korah_esau": {
    "name": "Korah (Esau's line)",
    "bio": "Son of Esau by Oholibamah, became an Edomite chief. Distinct from Korah the Levite who rebelled against Moses.",
    "scripture": "Gen 36:5, 14, 18; 1 Chr 1:35",
    "descendants": []
  },
  "jacob": {
    "name": "Jacob (Israel)",
    "bio": "Son of Isaac and Rebekah, twin brother of Esau (born holding his heel). His name means 'supplanter.' Bought Esau's birthright and deceived Isaac to receive the blessing. Fled to Haran where he served Laban 20 years for his wives Leah and Rachel. At Peniel, he wrestled with God and was renamed Israel ('he struggles with God'). Father of the twelve tribes of Israel through four women. Favored Joseph and Benjamin (Rachel's sons). Moved to Egypt in old age where he blessed his sons and grandsons before dying at 147. His body was returned to Canaan for burial.",
    "scripture": "Gen 25:19-50:14; Ex 1:1-5; Matt 1:2; 8:11; Luke 3:34; John 4:5-6; Acts 7:8-16; Rom 9:11-13; Heb 11:9, 21",
    "descendants": [
      "reuben",
      "simeon",
      "levi",
      "judah",
      "dan",
      "naphtali",
      "gad",
      "asher",
      "issachar",
      "zebulun",
      "joseph",
      "benjamin"
    ]
  },
  "dinah": {
    "name": "Dinah",
    "bio": "Daughter of Jacob and Leah. She was defiled by Shechem, son of Hamor the Hivite. Though Shechem wanted to marry her, her brothers Simeon and Levi massacred all the men of the city in revenge, which Jacob condemned as bringing trouble upon him.",
    "scripture": "Gen 30:21; 34:1-31; 46:15",
    "descendants": []
  },
  "leah": {
    "name": "Leah",
    "bio": "Elder daughter of Laban, first wife of Jacob (through deception). Mother of six sons (Reuben, Simeon, Levi, Judah, Issachar, Zebulun) and one daughter (Dinah). Though unloved compared to Rachel, God saw her affliction and blessed her with many children. Through Judah came the royal line to David and Christ. Buried in the cave of Machpelah.",
    "scripture": "Gen 29:16-30:21; 31:4, 14; 33:1-2, 7; 35:23, 26; 46:15, 18; 49:31; Ruth 4:11",
    "descendants": []
  },
  "rachel": {
    "name": "Rachel",
    "bio": "Younger daughter of Laban, beloved wife of Jacob. Beautiful and loved, yet initially barren while her sister Leah bore children. Finally bore Joseph, then died giving birth to Benjamin near Bethlehem. Jacob set up a pillar on her grave. Her desperate cry 'Give me children, or I'll die' and later death in childbirth are deeply poignant. Mother of Joseph (through whom came Ephraim and Manasseh) and Benjamin.",
    "scripture": "Gen 29:6-30:24; 31:4-35; 33:1-2, 7; 35:16-20, 24-25; 46:19, 22, 25; 48:7; Ruth 4:11; 1 Sam 10:2; Jer 31:15; Matt 2:18",
    "descendants": []
  },
  "reuben": {
    "name": "Reuben",
    "bio": "Firstborn son of Jacob by Leah. Lost his birthright because he slept with his father's concubine Bilhah. He tried to save Joseph from his brothers but failed. Later offered his own two sons as surety for Benjamin. His tribe settled east of the Jordan. Jacob's blessing predicted he would not excel. The tribe of Reuben eventually declined in importance.",
    "scripture": "Gen 29:32; 30:14; 35:22-23; 37:21-30; 42:22, 37; 46:8-9; 48:5; 49:3-4; Ex 1:2; 6:14; Num 1:5, 20-21; 26:5-11; Deut 33:6; 1 Chr 2:1; 5:1-10",
    "descendants": [
      "hanoch_reuben",
      "pallu",
      "hezron_reuben",
      "carmi_reuben"
    ]
  },
  "hanoch_reuben": {
    "name": "Hanoch (Reuben's line)",
    "bio": "Son of Reuben, founder of the Hanochite clan.",
    "scripture": "Gen 46:9; Ex 6:14; Num 26:5; 1 Chr 5:3",
    "descendants": []
  },
  "pallu": {
    "name": "Pallu",
    "bio": "Son of Reuben, founder of the Palluite clan. Father of Eliab.",
    "scripture": "Gen 46:9; Ex 6:14; Num 26:5, 8; 1 Chr 5:3",
    "descendants": [
      "eliab_pallu"
    ]
  },
  "eliab_pallu": {
    "name": "Eliab (Pallu's line)",
    "bio": "Son of Pallu, father of Dathan, Abiram, and Nemuel. His sons Dathan and Abiram joined Korah's rebellion against Moses and were swallowed by the earth.",
    "scripture": "Num 16:1, 12; 26:8-9; Deut 11:6",
    "descendants": [
      "nemuel_eliab",
      "dathan",
      "abiram"
    ]
  },
  "nemuel_eliab": {
    "name": "Nemuel (Eliab's line)",
    "bio": "Son of Eliab, brother of Dathan and Abiram. Apparently did not join their rebellion.",
    "scripture": "Num 26:9",
    "descendants": []
  },
  "dathan": {
    "name": "Dathan",
    "bio": "Son of Eliab, from the tribe of Reuben. Along with his brother Abiram and Korah the Levite, he rebelled against Moses' leadership. The earth opened and swallowed them alive with their families and possessions. Their fate became a warning to future generations.",
    "scripture": "Num 16:1-35; 26:9-10; Deut 11:6; Ps 106:17",
    "descendants": []
  },
  "abiram": {
    "name": "Abiram (Reuben's line)",
    "bio": "Son of Eliab, brother of Dathan. Joined in the rebellion against Moses and Aaron. Like his brother, he was swallowed alive by the earth in God's judgment.",
    "scripture": "Num 16:1-35; 26:9-10; Deut 11:6; Ps 106:17",
    "descendants": []
  },
  "hezron_reuben": {
    "name": "Hezron (Reuben's line)",
    "bio": "Son of Reuben, founder of the Hezronite clan. Distinct from Hezron of Judah's line.",
    "scripture": "Gen 46:9; Ex 6:14; Num 26:6; 1 Chr 5:3",
    "descendants": []
  },
  "carmi_reuben": {
    "name": "Carmi (Reuben's line)",
    "bio": "Son of Reuben, founder of the Carmite clan. Distinct from other Carmis in Scripture.",
    "scripture": "Gen 46:9; Ex 6:14; Num 26:6; 1 Chr 5:3",
    "descendants": []
  },
  "simeon": {
    "name": "Simeon",
    "bio": "Second son of Jacob by Leah. With his brother Levi, he treacherously killed all the men of Shechem in revenge for Dinah's defilement. Jacob's blessing cursed their anger and scattered them in Israel. Simeon was held hostage in Egypt while his brothers returned to get Benjamin. His tribe received land within Judah's territory and eventually was largely absorbed by Judah.",
    "scripture": "Gen 29:33; 34:25-31; 42:24, 36; 43:23; 46:10; 48:5; 49:5-7; Ex 1:2; 6:15; Num 1:6, 22-23; 26:12-14; Deut 33 (notably absent); Josh 19:1-9; 1 Chr 2:1; 4:24-43",
    "descendants": [
      "jemuel",
      "jamin",
      "ohad",
      "jachin",
      "zohar",
      "shaul"
    ]
  },
  "jemuel": {
    "name": "Jemuel",
    "bio": "Son of Simeon, founder of a Simeonite clan (also called Nemuel).",
    "scripture": "Gen 46:10; Ex 6:15; Num 26:12; 1 Chr 4:24",
    "descendants": []
  },
  "jamin": {
    "name": "Jamin (Simeon's line)",
    "bio": "Son of Simeon, founder of the Jaminite clan.",
    "scripture": "Gen 46:10; Ex 6:15; Num 26:12; 1 Chr 4:24",
    "descendants": []
  },
  "ohad": {
    "name": "Ohad",
    "bio": "Son of Simeon. His clan is not mentioned in later genealogies, suggesting it died out or was absorbed.",
    "scripture": "Gen 46:10; Ex 6:15",
    "descendants": []
  },
  "jachin": {
    "name": "Jachin (Simeon's line)",
    "bio": "Son of Simeon, founder of the Jachinite clan (also called Jarib).",
    "scripture": "Gen 46:10; Ex 6:15; Num 26:12; 1 Chr 4:24",
    "descendants": []
  },
  "zohar": {
    "name": "Zohar (Simeon's line)",
    "bio": "Son of Simeon, founder of the Zoharite clan (also called Zerah).",
    "scripture": "Gen 46:10; Ex 6:15; Num 26:13; 1 Chr 4:24",
    "descendants": []
  },
  "shaul": {
    "name": "Shaul (Simeon's son)",
    "bio": "Son of Simeon by a Canaanite woman, founder of the Shaulite clan.",
    "scripture": "Gen 46:10; Ex 6:15; Num 26:13; 1 Chr 4:24-25",
    "descendants": []
  },
  "levi": {
    "name": "Levi",
    "bio": "Third son of Jacob by Leah. With Simeon, violently avenged Dinah's defilement, earning Jacob's curse of being scattered in Israel. However, God transformed this curse into blessing: the Levites became the priestly tribe, scattered among all Israel to teach God's law. Moses, Aaron, and Miriam descended from him. Levites received no territorial inheritance but were given cities throughout Israel. Lived 137 years.",
    "scripture": "Gen 29:34; 34:25-31; 46:11; 49:5-7; Ex 1:2; 2:1; 6:16-25; 32:25-29; Num 3:1-4:49; 18:1-32; 26:57-62; Deut 10:8-9; 33:8-11; 1 Chr 2:1; 6:1-81; Mal 2:4-9; Heb 7:5-10",
    "descendants": [
      "gershon",
      "kohath",
      "merari"
    ]
  },
  "gershon": {
    "name": "Gershon",
    "bio": "Firstborn son of Levi. His descendants formed one of the three main Levitical clans, responsible for the tabernacle's coverings, curtains, and hangings. They camped west of the tabernacle.",
    "scripture": "Gen 46:11; Ex 6:16-17; Num 3:17-26; 4:22-28; 7:7; 10:17; 26:57; Josh 21:6, 27-33; 1 Chr 6:1, 17, 20, 43, 62, 71; 15:7; 23:6-11",
    "descendants": [
      "libni",
      "shimei_gershon"
    ]
  },
  "libni": {
    "name": "Libni",
    "bio": "Son of Gershon, head of the Libnite clan among the Levites.",
    "scripture": "Ex 6:17; Num 3:18, 21; 26:58; 1 Chr 6:17, 20",
    "descendants": []
  },
  "shimei_gershon": {
    "name": "Shimei (Gershon's line)",
    "bio": "Son of Gershon, head of the Shimeite clan among the Levites. Distinct from other Shimeis in Scripture.",
    "scripture": "Ex 6:17; Num 3:18, 21; 26:58; 1 Chr 6:17; 23:7-10",
    "descendants": []
  },
  "kohath": {
    "name": "Kohath",
    "bio": "Second son of Levi, ancestor of Moses, Aaron, and the priestly line. His descendants were responsible for the most holy things of the tabernacle. They camped south of the tabernacle. Through Amram came Moses and Aaron. Lived 133 years. The Kohathites received 23 cities in Israel.",
    "scripture": "Gen 46:11; Ex 6:16, 18; Num 3:17, 19, 27-32; 4:2-20, 34-37; 16:1; 26:57-58; Josh 21:4-5, 10, 20-26; 1 Chr 6:1-2, 16, 18, 22, 38, 54, 61, 66, 70; 15:5; 23:6, 12-20",
    "descendants": [
      "amram",
      "izhar",
      "hebron_kohath",
      "uzziel"
    ]
  },
  "amram": {
    "name": "Amram",
    "bio": "Son of Kohath, married his aunt Jochebed. Father of Moses, Aaron, and Miriam—the three great leaders of the Exodus. Through him came both the priestly line (Aaron) and the prophetic leader who delivered Israel from Egypt (Moses). Lived 137 years.",
    "scripture": "Ex 6:18, 20; Num 3:19; 26:58-59; 1 Chr 6:3, 18; 23:12-13; 24:20",
    "descendants": [
      "aaron",
      "moses",
      "miriam"
    ]
  },
  "aaron": {
    "name": "Aaron",
    "bio": "Son of Amram and Jochebed, brother of Moses and Miriam. First high priest of Israel, from whom all legitimate priests descended. Spokesman for Moses before Pharaoh. His rod budded to confirm his priestly calling. Made the golden calf when Moses was on the mountain. His sons Nadab and Abihu died for offering unauthorized fire. Died on Mount Hor at age 123 after seeing the Promised Land but not entering due to striking the rock at Meribah.",
    "scripture": "Ex 4:14-7:13; 28:1-29:46; 32:1-35; Lev 8-10; Num 3:1-4; 12:1-16; 16:1-17:13; 18:1-20:29; 26:59-60; 33:38-39; Deut 10:6; Josh 24:5; 1 Chr 6:3, 49-50; 23:13; Ps 77:20; 99:6; 105:26; 106:16; Mic 6:4; Heb 5:4; 7:11; 9:4",
    "descendants": [
      "nadab_aaron",
      "abihu",
      "eleazar",
      "ithamar"
    ]
  },
  "nadab_aaron": {
    "name": "Nadab (Aaron's son)",
    "bio": "Firstborn son of Aaron. He and his brother Abihu offered unauthorized fire before the LORD and were consumed by fire from God's presence on the same day they were ordained as priests. They had no children. Their deaths taught the holiness required in approaching God.",
    "scripture": "Ex 6:23; 24:1, 9; 28:1; Lev 10:1-7; Num 3:2-4; 26:60-61; 1 Chr 6:3; 24:1-2",
    "descendants": []
  },
  "abihu": {
    "name": "Abihu",
    "bio": "Second son of Aaron. With his brother Nadab, he died for offering unauthorized fire before the LORD. This occurred shortly after their ordination, serving as a severe warning about the holiness required in priestly service. They had no children.",
    "scripture": "Ex 6:23; 24:1, 9; 28:1; Lev 10:1-7; Num 3:2-4; 26:60-61; 1 Chr 6:3; 24:1-2",
    "descendants": []
  },
  "eleazar": {
    "name": "Eleazar",
    "bio": "Third son of Aaron, married a daughter of Putiel. After his older brothers died, he became Aaron's successor as high priest. Helped Moses with the second census and assisted Joshua in dividing the Promised Land. Supervised the tabernacle and its holy objects. Father of Phinehas. The high priesthood continued through his line.",
    "scripture": "Ex 6:23, 25; 28:1; Lev 10:6, 12, 16; Num 3:2-4, 32; 4:16; 16:36-40; 19:3-4; 20:25-29; 25:7-11; 26:1-3, 60, 63; 27:2, 15-23; 31:12-54; 32:2, 28; 34:17; Deut 10:6; Josh 14:1; 17:4; 19:51; 21:1; 22:13-32; 24:33; Judg 20:28; 1 Chr 6:3-4, 50; 24:1-6",
    "descendants": [
      "phinehas"
    ]
  },
  "phinehas": {
    "name": "Phinehas (Eleazar's son)",
    "bio": "Son of Eleazar, grandson of Aaron. His name means 'bronze serpent' or 'Nubian.' Zealous for God's honor, he killed an Israelite man and Midianite woman during a plague, stopping God's wrath. God made a covenant of perpetual priesthood with him for his zeal. He served as high priest and was consulted about civil war with Benjamin. Lived to see Joshua's death.",
    "scripture": "Ex 6:25; Num 25:6-18; 31:6; Josh 22:13-34; 24:33; Judg 20:28; 1 Chr 6:4, 50; 9:20; Ezra 7:5; 8:2; Ps 106:30-31",
    "descendants": [
      "abishua"
    ]
  },
  "abishua": {
    "name": "Abishua",
    "bio": "Son of Phinehas, high priest. Part of the faithful priestly line through Eleazar and Phinehas.",
    "scripture": "1 Chr 6:4-5, 50; Ezra 7:5",
    "descendants": [
      "bukki"
    ]
  },
  "bukki": {
    "name": "Bukki",
    "bio": "Son of Abishua, high priest in the line from Aaron to Zadok.",
    "scripture": "1 Chr 6:5, 51; Ezra 7:4",
    "descendants": [
      "uzzi_bukki"
    ]
  },
  "uzzi_bukki": {
    "name": "Uzzi (Bukki's line)",
    "bio": "Son of Bukki, high priest. Distinct from other Uzzis in Scripture.",
    "scripture": "1 Chr 6:5-6, 51; Ezra 7:4",
    "descendants": [
      "zerahiah"
    ]
  },
  "zerahiah": {
    "name": "Zerahiah",
    "bio": "Son of Uzzi, high priest in the unbroken line to Zadok.",
    "scripture": "1 Chr 6:6, 51; Ezra 7:4",
    "descendants": [
      "meraioth"
    ]
  },
  "meraioth": {
    "name": "Meraioth",
    "bio": "Son of Zerahiah, high priest. Part of the genealogy recorded to establish Ezra's priestly credentials.",
    "scripture": "1 Chr 6:6-7, 52; 9:11; Ezra 7:3; Neh 11:11; 12:15",
    "descendants": [
      "amariah_meraioth"
    ]
  },
  "amariah_meraioth": {
    "name": "Amariah (Meraioth's line)",
    "bio": "Son of Meraioth, high priest in David's time.",
    "scripture": "1 Chr 6:7, 11, 52; Ezra 7:3",
    "descendants": [
      "ahitub"
    ]
  },
  "ahitub": {
    "name": "Ahitub (Amariah's son)",
    "bio": "Son of Amariah, father of Zadok the high priest. Through him the priesthood was secured in David and Solomon's reign.",
    "scripture": "2 Sam 8:17; 1 Chr 6:7-8, 11-12, 52; 9:11; 18:16; Ezra 7:2; Neh 11:11",
    "descendants": [
      "zadok"
    ]
  },
  "zadok": {
    "name": "Zadok",
    "bio": "Son of Ahitub, high priest during David and Solomon's reigns. Remained faithful to David during Absalom's rebellion and supported Solomon against Adonijah. Anointed Solomon as king. God promised the priesthood would remain in his line. Ezekiel prophesied that Zadok's descendants would serve in the future temple. His name means 'righteous.'",
    "scripture": "2 Sam 8:17; 15:24-36; 17:15; 18:19-27; 19:11; 20:25; 1 Kgs 1:8-45; 2:35; 4:2, 4; 1 Chr 6:8, 12, 53; 12:28; 15:11; 16:39; 18:16; 24:3, 6, 31; 27:17; 29:22; 2 Chr 31:10; Ezra 7:2; Ezek 40:46; 43:19; 44:15; 48:11",
    "descendants": [
      "ahimaaz"
    ]
  },
  "ahimaaz": {
    "name": "Ahimaaz",
    "bio": "Son of Zadok. A swift runner who served as messenger for David during Absalom's rebellion. He and Jonathan (son of Abiathar) kept David informed of events in Jerusalem. He wanted to carry news of Absalom's death but was sent after a Cushite messenger.",
    "scripture": "2 Sam 15:27, 36; 17:17-20; 18:19-33; 1 Kgs 4:15; 1 Chr 6:8-9, 53",
    "descendants": [
      "azariah_ahimaaz"
    ]
  },
  "azariah_ahimaaz": {
    "name": "Azariah (Ahimaaz's line)",
    "bio": "Son of Ahimaaz, high priest. Distinct from other Azariahs in the priestly line.",
    "scripture": "1 Chr 6:9",
    "descendants": [
      "johanan_azariah"
    ]
  },
  "johanan_azariah": {
    "name": "Johanan (Azariah's line)",
    "bio": "Son of Azariah, high priest.",
    "scripture": "1 Chr 6:9-10",
    "descendants": [
      "azariah_johanan"
    ]
  },
  "azariah_johanan": {
    "name": "Azariah (Johanan's line)",
    "bio": "Son of Johanan, high priest who served in Solomon's temple. Possibly the same Azariah who opposed King Uzziah's unauthorized entry into the temple.",
    "scripture": "1 Chr 6:10-11; 2 Chr 26:17-20",
    "descendants": [
      "amariah2"
    ]
  },
  "adam": {
    "name": "Adam",
    "bio": "First man, created by God from dust on the sixth day. Placed in the Garden of Eden to work and keep it. God created Eve from Adam's rib as his helper. They had dominion over all creation. Sinned by eating forbidden fruit, bringing death into the world. Expelled from Eden. Father of Cain, Abel, Seth, and other sons and daughters. Lived 930 years. His name means 'man' or 'red earth.' He is the head of the human race, as Christ is head of the new creation.",
    "scripture": "Gen 1:26-27; 2:7-25; 3:1-24; 4:1-2, 25; 5:1-5; 1 Chr 1:1; Luke 3:38; Rom 5:12-21; 1 Cor 15:22, 45; 1 Tim 2:13-14",
    "descendants": [
      "cain",
      "abel",
      "seth"
    ]
  },
  "enos": {
    "name": "Enos (Enosh)",
    "bio": "Son of Seth, born when Seth was 105. His name means 'mortal' or 'frail man.' In his days men began to call upon the name of the LORD in a formal, public way. Father of Cainan. Lived 905 years.",
    "scripture": "Gen 4:26; 5:6-11; 1 Chr 1:1; Luke 3:38",
    "descendants": [
      "cainan"
    ]
  },
  "cainan": {
    "name": "Cainan (Kenan)",
    "bio": "Son of Enos, born when Enos was 90 years old. Father of Mahalaleel. Lived 910 years. Part of the godly line from Adam to Noah.",
    "scripture": "Gen 5:9-14; 1 Chr 1:2; Luke 3:37",
    "descendants": [
      "mahalaleel"
    ]
  },
  "mahalaleel": {
    "name": "Mahalaleel (Mahalalel)",
    "bio": "Son of Cainan, born when Cainan was 70. His name means 'praise of God.' Father of Jared. Lived 895 years.",
    "scripture": "Gen 5:12-17; 1 Chr 1:2; Luke 3:37",
    "descendants": [
      "jared"
    ]
  },
  "lamech_noah": {
    "name": "Lamech (Noah's father)",
    "bio": "Son of Methuselah, father of Noah. When Noah was born, Lamech prophesied that he would bring comfort concerning the ground God had cursed. Lived 777 years. Died five years before the Flood. Distinct from Lamech in Cain's line.",
    "scripture": "Gen 5:25-31; 1 Chr 1:3; Luke 3:36",
    "descendants": [
      "noah"
    ]
  },
  "jesus": {
    "name": "Jesus Christ",
    "bio": "Son of God, Son of Mary, legally son of Joseph. His name means 'The LORD saves.' Conceived by the Holy Spirit, born of the virgin Mary in Bethlehem, fulfilling prophecy. The eternal Word who became flesh. Fully God and fully man. Born under the Law, lived sinlessly. At 30, began public ministry. Preached the kingdom, performed miracles, called disciples. Betrayed by Judas, arrested, tried illegally, crucified under Pontius Pilate. Died for the sins of the world. Rose on the third day, appeared to many. Ascended to heaven, seated at God's right hand. He is Prophet, Priest, and King. The promised Messiah, Son of David, seed of Abraham. Second person of the Trinity. Savior of all who believe. He will return to judge the living and the dead and reign forever. He is the Alpha and Omega, beginning and end.",
    "scripture": "Matt 1:1-28:20; Mark 1:1-16:20; Luke 1:1-24:53; John 1:1-21:25; Acts 1:1-28:31; Rom 1:1-16:27; 1 Cor 1:1-16:24; Gal 1:1-6:18; Eph 1:1-6:24; Phil 1:1-4:23; Col 1:1-4:18; 1 Thess 1:1-5:28; 1 Tim 1:1-6:21; 2 Tim 1:1-4:22; Titus 1:1-3:15; Heb 1:1-13:25; 1 Pet 1:1-5:14; 2 Pet 1:1-3:18; 1 John 1:1-5:21; Rev 1:1-22:21",
    "descendants": []
  },
  "mary": {
    "name": "Mary (Jesus' mother)",
    "bio": "Mother of Jesus, wife of Joseph. From Nazareth, descendant of David. A virgin betrothed to Joseph when the angel Gabriel announced she would conceive by the Holy Spirit and bear the Son of God. She responded with faith: 'Behold the handmaid of the Lord.' Visited her cousin Elizabeth (pregnant with John the Baptist) and sang the Magnificat. Gave birth to Jesus in Bethlehem. Fled to Egypt with Joseph to escape Herod. Raised Jesus in Nazareth. At the wedding in Cana, she told the servants to do whatever Jesus said. She stood by the cross when Jesus died; He entrusted her to John's care. She was with the disciples after the ascension, praying in the upper room. Catholic and Orthodox traditions honor her highly, while Protestants recognize her faithful obedience. She had other children with Joseph after Jesus.",
    "scripture": "Matt 1:16-2:23; 12:46; 13:55; Mark 3:31; 6:3; Luke 1:26-2:52; 8:19-21; John 2:1-12; 19:25-27; Acts 1:14",
    "descendants": []
  },
  "peter": {
    "name": "Peter (Simon Peter)",
    "bio": "Original name Simon, son of Jonah (John), brother of Andrew. From Bethsaida, a fisherman. Jesus named him Cephas (Peter) meaning 'rock.' One of the Twelve Apostles, part of Jesus' inner circle with James and John. Walked on water to Jesus. Confessed Jesus as 'the Christ, the Son of the living God'; Jesus said on this rock He would build His church. Witnessed the Transfiguration. Cut off the high priest's servant's ear. Denied Jesus three times but was restored. Preached at Pentecost; 3,000 saved. Led the early church. Vision of unclean animals led to accepting Gentiles. Confronted by Paul for hypocrisy regarding Gentiles. Wrote 1 and 2 Peter. Tradition says he was crucified upside down in Rome under Nero. Considered first pope by Catholics, though this is disputed by Protestants.",
    "scripture": "Matt 4:18-19; 8:14; 10:2; 14:28-31; 16:16-19; 17:1-5; 26:31-75; Mark 1:16-18, 29-31, 36; 3:16; 5:37; 8:29, 33; 9:2-5; 13:3; 14:29-72; 16:7; Luke 5:1-11; 6:14; 8:45, 51; 9:20, 28-33; 12:41; 18:28; 22:8, 31-34, 54-62; 24:12, 34; John 1:40-42, 44; 6:8, 68; 13:6-9, 24, 36-38; 18:10-27; 20:2-9; 21:1-22; Acts 1:13-15; 2:14-41; 3:1-26; 4:8-22; 5:1-42; 8:14-25; 9:32-43; 10:1-11:18; 12:3-19; 15:7-11; Gal 1:18; 2:7-14; 1 Pet 1:1; 2 Pet 1:1",
    "descendants": []
  },
  "paul": {
    "name": "Paul (Saul of Tarsus)",
    "bio": "Originally Saul, from Tarsus in Cilicia. Tribe of Benjamin, Pharisee, studied under Gamaliel. Roman citizen. Zealously persecuted Christians, approving Stephen's stoning. On the road to Damascus, encountered the risen Christ; was blinded, then healed by Ananias. Called to be apostle to the Gentiles. After time in Arabia, began missionary journeys establishing churches throughout the Roman Empire. Wrote 13 (or 14) New Testament epistles. Imprisoned multiple times for the gospel. Appealed to Caesar as a Roman citizen; taken to Rome. Under house arrest, continued preaching. Tradition says he was beheaded in Rome under Nero. His theology profoundly shaped Christian doctrine on grace, faith, justification, the church, and Christ. Called himself the 'least of the apostles' and 'chief of sinners' yet ran his race with endurance.",
    "scripture": "Acts 7:58; 8:1-3; 9:1-30; 11:25-30; 12:25-28:31; Rom 1:1; 1 Cor 1:1; 2 Cor 1:1; Gal 1:1-2:21; Eph 1:1; Phil 1:1; Col 1:1; 1 Thess 1:1; 2 Thess 1:1; 1 Tim 1:1; 2 Tim 1:1; Titus 1:1; Phlm 1:1; 2 Pet 3:15-16",
    "descendants": []
  },
  "john_apostle": {
    "name": "John (the Apostle)",
    "bio": "Son of Zebedee, brother of James. From Galilee, a fisherman. One of the Twelve, part of Jesus' inner circle with Peter and James. Called 'sons of thunder' with his brother. The 'disciple whom Jesus loved' - reclined on Jesus' breast at the Last Supper. Witnessed the Transfiguration and Gethsemane. At the cross, Jesus entrusted Mary His mother to John's care. Ran to the tomb with Peter. After Pentecost, served with Peter in Jerusalem. Wrote the Gospel of John, 1-3 John, and Revelation. Exiled to Patmos where he received the Revelation. Tradition says he was the only apostle not martyred, living to old age in Ephesus. His writings emphasize love, light, truth, and the deity of Christ. Called himself 'the elder.'",
    "scripture": "Matt 4:21; 10:2; 17:1; 26:37; Mark 1:19-20, 29; 3:17; 5:37; 9:2, 38; 10:35, 41; 13:3; 14:33; Luke 5:10; 6:14; 8:51; 9:28, 49, 54; 22:8; John 13:23; 19:26-27; 20:2-8; 21:2, 7, 20-24; Acts 1:13; 3:1-11; 4:13-22; 8:14-25; Gal 2:9; 1 John 1:1; 2 John 1:1; 3 John 1:1; Rev 1:1, 4, 9; 22:8",
    "descendants": []
  },
  "james_apostle": {
    "name": "James (the Apostle, son of Zebedee)",
    "bio": "Son of Zebedee, brother of John. From Galilee, a fisherman. One of the Twelve, part of Jesus' inner circle with Peter and John. With John, called 'sons of thunder' - they wanted to call down fire on a Samaritan village. Witnessed the Transfiguration, the raising of Jairus' daughter, and Gethsemane. The first apostle martyred - Herod Agrippa I had him killed with the sword circa AD 44. Distinct from James the Lord's brother and James son of Alphaeus.",
    "scripture": "Matt 4:21; 10:2; 17:1; 26:37; Mark 1:19-20, 29; 3:17; 5:37; 9:2, 38; 10:35, 41; 13:3; 14:33; Luke 5:10; 6:14; 8:51; 9:28, 49, 54; Acts 1:13; 12:2",
    "descendants": []
  },
  "james_lords_brother": {
    "name": "James (the Lord's brother)",
    "bio": "Brother (or half-brother) of Jesus, son of Mary and Joseph. Did not believe in Jesus during His ministry. After the resurrection, Jesus appeared to him specifically. Became a leader of the Jerusalem church. At the Jerusalem Council, he spoke decisively about Gentile believers. Paul called him a 'pillar' of the church. Wrote the Epistle of James, emphasizing faith shown by works. Tradition says he was known as 'James the Just' for his righteousness and prayer life. According to Josephus and tradition, he was martyred by being thrown from the temple pinnacle, then stoned, circa AD 62. Distinct from James son of Zebedee and James son of Alphaeus.",
    "scripture": "Matt 13:55; Mark 6:3; John 7:5; Acts 1:14; 12:17; 15:13-21; 21:18; 1 Cor 15:7; Gal 1:19; 2:9, 12; James 1:1; Jude 1:1",
    "descendants": []
  },
  "jude": {
    "name": "Jude (Judas, the Lord's brother)",
    "bio": "Brother (or half-brother) of Jesus and James, son of Mary and Joseph. Called Judas, but distinguished from Judas Iscariot. One of the Twelve (also called Thaddaeus or Lebbaeus). Did not believe in Jesus during His ministry but was converted after the resurrection. Wrote the Epistle of Jude, warning against false teachers and contending for the faith. Quotes from Enoch and possibly the Assumption of Moses. Begins his epistle calling himself 'servant of Jesus Christ and brother of James' rather than claiming to be Jesus' brother. Tradition says he preached in various regions and was martyred, possibly with Simon the Zealot.",
    "scripture": "Matt 13:55; Mark 6:3; John 14:22; Acts 1:13-14; Jude 1:1",
    "descendants": []
  }
}